[
    {
      "basic": {
        "name": "Murudeshwar",
        "bio": "Murdeshwar is a town in Uttara Kannada district in the state of Karnataka, India, It is famous for the world's second tallest Shiva statue, the town lies on the coast of the Arabian Sea and is also famous for the Murudeshwara Temple. The town has a railway station on the Mangalore–Mumbai Konkan railway route.",
        "location": {
          "pin": "Bhatkal",
          "dist": "Uttara Kannada",
          "state": "Karnataka",
          "iframe": "https://www.mappls.com/7s513d"
        },
        "coordinates": {
          "x": 14.093617,
          "y": 74.483825
        },
        "website": ""
      },
      "Architecture": {
        "style": "Gopura",
        "creator": "Rama Nagappa Shetty",
        "completed": "2008",
        "inscriptions": "None",
        "elevation": 38
      },
      "about": {
        "basic_info": "      The origin of the name 'Murdeshwar' dates to the time of Ramayana. The Hindu gods attained immortality and invincibility by worshiping a divine Linga called the Atma-Linga. The Lanka King Ravana wanted to attain immortality by obtaining the Atma-Linga (Soul of Shiva). Since the Atma-Linga belonged to Shiva, Ravana worshipped Shiva with devotion. Pleased by his prayers, Shiva appeared before him and asked him what he wanted. Ravana asked for the Atma-Linga. Shiva agreed to give him the boon on the condition that it should never be placed on the ground before he reaches Lanka. If the Atma-Linga was ever placed on the ground, it would be impossible to move it. Having obtained his boon, Ravana started back on his journey to Lanka.Lord Vishnu, who learned of this incident, realised that with the Atma-Linga, Ravana may obtain immortality and wreak havoc on earth. He approached Ganesha and requested him to prevent the Atma-Linga from reaching Lanka. Ganesha knew that Ravana was a very devoted person who performed prayer rituals every evening without fail. He decided to make use of this fact and came up with a plan to confiscate the Atma-Linga from Ravana.As Ravana was nearing Gokarna, Vishnu blotted out the sun to give the appearance of dusk. Ravana now had to perform his evening rituals but was worried because with the Atma-Linga in his hands, he would not be able to do his rituals. At this time, Ganesha in the disguise of a Brahmin boy accosted him. Ravana requested him to hold the Atma-Linga until he performed his rituals, and asked him not to place it on the ground. Ganesha struck a deal with him saying that he would call Ravana thrice, and if Ravana did not return within that time, he would place the Atma-Linga on the ground.Ravana returned to find that Ganesha had already placed the Atma-Linga on the ground. Vishnu then removed his illusion and it was daylight again. Ravana, realising that he had been tricked, tried to uproot and destroy the linga. Due to the force exerted by Ravana, some pieces were scattered. One such piece from the head of the linga is said to have fallen in present-day Surathkal. The famous Sadashiva temple is said to be built around that piece of linga. Then he decided to destroy the covering of the Atma-Linga, and threw the case covering it to a place called Sajjeshwar, 37 kilometers away. Then he threw the lid of the case to a place called Guneshwar (now Gunavanthe) and Dhareshwar, 16-19 kilometers away. Finally, he threw the cloth covering the Atma-Linga to a place called Mrideshwar in Kanduka-Giri (Kanduka Hill). Mrideshwar has been renamed to Murdeshwar.",
        "history": "The temple itself has been named as per its significance, Murudeshwara refers to Shiva. The interesting story of the temple has been linked to the ear of Ramayana. As a result of the penance dedicated to the Atma Linga, Lord Shiva gave the power of invincibility and immortality to Hindu Gods. Consequently Ravana, the king of Lanka also tried wooing Lord Shiva by worshipping him so as to attain invincibility and immortality. When Lord Shiva appears before Ravana after looking at his devotion, and he asks Ravana to tell him, whatever he wants. Ravana then asks for Goddess parvathi and Lord thus gives Parvathi to Ravana.On the way to Lanka, Narada muni deceits him into believing that the one who was with him was not Parvathi and the real Parvathi is in Pathala. Consequently Ravana went to Pathala and married a king’s daughter who believed was real Parvathi. After knowing that he has been fooled by Naryana, he again sits to meditate As a result of which Lord Shiva Appears. This time he asked Lord Shiva to bless him with the sacred Atma Linga and Shiva accepting his demand, gave him the Lingam but puts a condition before Ravana that if ever this Lingam will be kept on the ground all its powers will come back to Lord Shiva.This made narada to realise that with Atma Linga in his hands, Ravana will create havoc on the earth by obtaining immortality and so he thought of approaching Lord Ganesha for help. While Ravana was on the way to Lanka, Lord Vishnu planned to remove the effect of the Sun’s light so as to make it appear as dusk which will compel Ravana to perform his evening rituals and he will have to put the Linga on the ground. While he was thinking of the curse of Atma Ling, a Brahmin boy approached him who was actually Lord Ganesha. Lord Ganesha had taken up the form so that he would put the Atma Linga on the ground while he goes for the evening rituals. Lord Ganesha’s plan worked and when Ravana returned he found the Linga on the ground. This made him furious and he understood about the plan and out of anger he tried destroying the Lingam. In the process he threw the case which was covering the Lingam to Sajjeshwara at a distance of 23 miles while the lid of the case he threw to Guneshwara and Dhareshwara situated at a distance of about 10-12 km. And the piece of cloth covering the Atma Lingam he threw to Mrideshwara which was later named as Murudeshwara.Also, at Murudeshwara, saint Bhagirath awaits for Ganga to come on the earth from the hair lock of Lord Shiva.",
        "architecture": "Murdeshwar Temple was built on the Kanduka Hill which is surrounded on three sides by the waters of the Arabian Sea. It is dedicated to lord shiva, and a 20-storied Raja Gopura is constructed at the temple in 2008. The temple authorities have installed a lift that provides a view of the 123-feet Sri Shiva idol from the top of the Raja Gopura. There is also a Rameshwara linga at the bottom of the hill, where devotees can do seva themselves. A Shaneswar temple has been built next to the idol of Sri Akshayaguna. Two life-size elephants in concrete stand guard at the steps leading to it. The entire temple and temple complex, including the 209-feet-tall Raja Gopura, is one among the tallest.There are statues of Sun Chariot on side of a park, pool, statues depicting Arjuna receiving Geetopadesham from Lord Krishna, Ravana being deceived by Ganesha in disguise, Shiva's manifestation as Bhagirath, descending Ganga, carved around the hill.The temple is entirely modernised with exception of the sanctum sanctorum which is still dark and retains its composure. The main deity is Sri Mridesa Linga, also called Murdeshwar. The linga is believed to be a piece of the original Atma Linga and is about two feet below ground level. The devotees performing special sevas like Abhisheka, Rudrabhisheka, Rathotsava etc., can view the deity by standing before the threshold of the sanctum and the Linga is illuminated by oil lamps held close by the priests. The Linga is essentially a rough rock inside a hollowed spot in the ground. Entry into the sanctum is banned for all devotees. A huge towering statue of Shiva, visible from great distances, is present in the temple complex. It is the third tallest statue of Shiva in the world. The tallest Shiva statue is in Rajasthan, known as the Statue of Belief.The statue is 123 feet (37 m) in height and took about two years to build. The statue was built by Shivamogga's Kashinath and several other sculptors, financed by businessman and philanthropist R. N. Shetty, at a cost of approximately ₹50 million. The idol is designed such that it gets the sunlight directly and thus appears sparkling"
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/4/4f/Lord_Shiva_statue_at_Murudeshwara.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/4/42/Lord_Shiva_the_tallest_statue_%40_Murudeswar.jpg"
      },
      "trip": {
        "best_time": "November to February",
        "nearest_road": "165km from Mangalore and 455km from Bangalore.",
        "nearest_railway": "Murudeshwara station is only 2 km away from the temple.",
        "by_air": "The nearest airport from the temple is Mangalore International airport which is situated at a distance of about 165km from the temple.",
        "festivals": "Maha Shivaratri (February or March) and Karthik (November to December) Purnima is celebrated in the temple with full fervour and enthusiasm."
      },
      "contact": {
        "address": "Murudeshwar Temple, NH 7, Bhatkal Taluk, Murudeshwar, North Canara, Karnataka- 581350",
        "phone": "9987998735"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/3/3b/Murudeshwara_raja_gopura_HDR%2C_Jul_2012.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/42/Lord_Shiva_the_tallest_statue_%40_Murudeswar.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/4e/Tower_of_Murudeswar.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/6/66/Murudeshwar_temple_from_beach.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/4c/Murudeshwar_Full_view.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/4f/Lord_Shiva_statue_at_Murudeshwara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/7/7a/Statue_of_Nandi_at_Murudeshwar_Temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/43/Murudeshwara_Temple.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/d/d4/Murudeswar_Shiva_Panoramic_view.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/6/64/Murudeshwar_Temple_Shiva.jpg"
      ],
      "tag": [
        ""
      ]
    },
    {
      "basic": {
        "name": "Brihadisvara",
        "bio": "Brihadishvara Temple, called Rajarajesvaram ('Lord of Rajaraja') by its builder, and known locally as Thanjai Periya Kovil ('Thanjavur Big Temple') and Peruvudaiyar Kovil, is a Shaivite Hindu temple built in a Chola architectural style located on the south bank of the Cauvery river in Thanjavur, Tamil Nadu, India.",
        "location": {
          "pin": "Bhatkal",
          "dist": "Thanjavur",
          "state": "Tamil Nadu",
          "iframe": "https://www.mappls.com/t7ffb7"
        },
        "coordinates": {
          "x": 10.782778,
          "y": 79.131667
        },
        "website": ""
      },
      "Architecture": {
        "style": "\tChola architecture",
        "creator": "\tRajaraja I",
        "completed": "1010 CE",
        "inscriptions": "\tTamil",
        "elevation": 66
      },
      "about": {
        "basic_info": "     Brihadishvara Temple, called Rajarajesvaram ('Lord of Rajaraja') by its builder, and known locally as Thanjai Periya Kovil ('Thanjavur Big Temple') and Peruvudaiyar Kovil, is a Shaivite Hindu temple built in a Chola architectural style located on the south bank of the Cauvery river in Thanjavur, Tamil Nadu, India.It is one of the largest Hindu temples and an exemplar of Tamil architecture. It is also called Dakshina Meru (Meru of the South). Built by Chola emperor Rajaraja I between 1003 and 1010 CE, the temple is a part of the UNESCO World Heritage Site known as the Great Living Chola Temples, along with the Chola-era Gangaikonda Cholapuram temple and Airavatesvara temple, which are about 70 kilometres (43 mi) and 40 kilometres (25 mi) to its northeast respectively.The original monuments of this 11th-century temple were built around a moat. It included gopura, the main temple, its massive tower, inscriptions, frescoes, and sculptures predominantly related to Shaivism, but also of Vaishnavism and Shaktism. The temple was damaged in its history and some artwork is now missing. Additional mandapam and monuments were added in the centuries that followed. The temple now stands amidst fortified walls that were added after the 16th century.Built using granite, the vimana tower above the shrine is one of the tallest in South India. The temple has a massive colonnaded prakara (corridor) and one of the largest Shiva lingas in India. It is also famed for the quality of its sculpture, as well as being the location that commissioned the brass Nataraja, Shiva as the lord of dance, in the 11th century. The complex includes shrines for Nandi, Parvati, Murugan, Ganesha, Sabhapati, Dakshinamurti, Chandeshvara, Varahi, Thiyagarajar of Thiruvarur, Siddhar Karuvoorar and others. The temple is one of the most visited tourist attractions in Tamil Nadu.",
        "history": "A spectrum of dravidian temple styles continued to develop from the fifth to the ninth century over the Chalukya era rule as evidenced in Aihole, Badami and Pattadakal, and then with the Pallava era as witnessed at Mamallapuram and other monuments. Thereafter, between 850 and 1280, Cholas emerged as the dominant dynasty. The early Chola period saw a greater emphasis on securing their geopolitical boundaries and less emphasis on architecture. In the tenth century, within the Chola empire emerged features such as the multifaceted columns with projecting square capitals. This, states George Michell, signaled the start of the new Chola style.This South Indian style is most fully realized both in scale and detail in the Brihadeshwara temple built between 1003 and 1010 by the Chola king Rajaraja I.Additions, renovations and repairsThe main temple along with its gopurams is from the early 11th century. The temple also saw additions, renovations, and repairs over the next 1,000 years. The raids and wars, particularly between Muslim Sultans who controlled Madurai and Hindu kings who controlled Thanjavur caused damage.These were repaired by Hindu dynasties that regained control. In some cases, the rulers attempted to renovate the temple with faded paintings, by ordering new murals on top of the older ones. In other cases, they sponsored the addition of shrines. The significant shrines of Kartikeya (Murugan), Parvati (Amman) and Nandi are from the 16th and 17th-century Nayaka era.Similarly the Dakshinamurti shrine was built later. It was well maintained by Marathas of Tanjore.",
        "architecture": "The Peruvudaiyar temple's plan and development utilizes the axial and symmetrical geometry rules. It is classified as Perunkoil (also called Madakkoil), a big temple built on a higher platform of a natural or man-made mounds. The temple complex is a rectangle that is almost two stacked squares, covering 240.79 metres (790.0 ft) east to west, and 121.92 metres (400.0 ft) north to south. In this space are five main sections: the sanctum with the towering superstructure (sri vimana), the Nandi hall in front (Nandi-mandapam) and in between these the main community hall (mukhamandapam), the great gathering hall (mahamandapam) and the pavilion that connects the great hall with the sanctum (Antrala).The temple complex integrates a large pillared and covered veranda (prakara) in its spacious courtyard, with a perimeter of about 450 metres (1,480 ft) for circumambulation. Outside this pillared veranda there are two walls of enclosure, the outer one being defensive and added in 1777 by the French colonial forces with gun-holes with the temple serving as an arsenal. They made the outer wall high, isolating the temple complex area. On its east end is the original main gopuram or gateway that is barrel vaulted. It is less than half the size of the main temple's vimana. Additional structures were added to the original temple after the 11th century, such as a mandapa in its northeast corner and additional gopurams (gateways) on its perimeters to allow people to enter and leave from multiple locations. Some of the shrines and structures were added during the Pandya, Nayaka, Vijayanagara and Maratha era, before the colonial era started, and these builders respected the original plans and symmetry rules. Inside the original temple courtyard, along with the main sanctum and Nandi-mandapam are two major shrines, one for Kartikeya and for Parvati. The complex has additional smaller shrines.The Peruvudaiyar temple continued the Hindu temple traditions of South India by adopting architectural and decorative elements, but its scale significantly exceeded the temples constructed before the 11th century. The Chola era architects and artisans innovated the expertise to scale up and build, particularly with heavy stone and to accomplish the 63.4 metres (208 ft) high towering vimana. The temple faces east, and once had a water moat around it. This has been filled up. The fortified wall now runs around this moat. The two walls have ornate gateways called the gopurams. These are made from stone and display entablature. The main gateways are on the east side. The first one is called the Keralantakan tiruvasal, which means the 'sacred gate of the Keralantakan'. The word Keralantakan was the surname of king Rajaraja who built it. About a 100 metres (330 ft) ahead is the inner courtyard gopuram called the Rajarajan tiruvasal. This is more decorated than the Keralantakan tiruvasal, such as with its adhishthanam relief work narrating scenes from the Puranas and other Hindu texts. The inner eastern gopuram leads to a vast courtyard, in which the shrines are all signed to east–west and north-west cardinal directions. The complex can be entered either on one axis through a five-story gopuram or with a second access directly to the huge main quadrangle through a smaller free-standing gopuram. The gopuram of the main entrance is 30 m high, smaller than the vimana.The main temple-related monuments and the great tower is in the middle of this courtyard. Around the main temple that is dedicated to Shiva, are smaller shrines, most of which are aligned axially. These are dedicated to his consort Parvati, his sons Murugan and Ganesha, Nandi, Varahi, Karuvur deva (the guru of Rajaraja Chola), Chandeshvara and Nataraja. The Nandi mandapam has a monolithic seated bull facing the sanctum. In between them are stairs leading to a columned porch and community gathering hall, then an inner mandapa connecting to the pradakshina patha, or circumambulation path. The Nandi (bull) facing the mukh-mandapam weighs about 25 tonnes. It is made of a single stone and is about 2 m in height, 6 m in length and 2.5 m in width. The image of Nandi is a monolithic one and is one of the largest in the country."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Entrance_Brihadeeswara.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/7/7f/Entrance_Brihadeeswara.jpg"
      },
      "trip": {
        "best_time": "November to March",
        "nearest_road": "Thanjavur has been conveniently connected to all the important cities.",
        "nearest_railway": "The nearest railway station to the Brihadeeswara temple is Tanjore.",
        "by_air": "The nearest of all the airports present in the nearby area is, Tiruchirapalli Airport which has been connected by the Indian Airlines and is 58 kms away from the temple. In addition to that, Trichy has also been connected to Chennai and Madurai by Indian Airlines.",
        "festivals": "Satabhisag of every month is considered as a festival of ruling stars and is considered as the birth time of Rajaraja. As per the Hindu calendar, in the month of Visaka, celebration at the temple takes place for a period of 9 days. People worship the Deity by bathing them with Champaka fragrant water."
      },
      "contact": {
        "address": "Membalam Rd, Balaganapathy Nagar, Thanjavur, Tamil Nadu 613007",
        "phone": "04362274476"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/d/df/MyTanjoreTripPic19.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/6/60/Brihadeeswarar_Temple_04.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/6/6e/TANJORE_2.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/a5/Thanjavur_Brihadeeswara_Temple_Entrance.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/5/51/Brihadeeswara_Temple_Gopuram_at_Night.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/01/Big_Temple_Thanjavur.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/0a/Thanjavur%2C_Brihadishwara_Temple_%287013915633%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/8e/Shiva_Nataraja_Tanjore_Bruxelles_02_10_2011_01.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/e/ec/Top_of_Brihadisvara_Temple%2C_Thanjavur.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/ac/PeruvudaiyarKoyilThanjavurDancePostition.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/a3/N-TN-C192_Nandi_Mandapam_ceiling_with_centuries_old_murals.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/9/9c/Tamil_Inscriptions_in_Thanjavur_Brahadeeshwara_Temple_written_1000_years_ago.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/aa/1000_years_Old_Thanjavur_Brihadeeshwara_Temple_View_at_Sunrise.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/a4/Brihadisvara_Temple%2C_Thanjavur%2C_Tamil_Nadu%2C_India.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/4a/An_elephant_relief_on_the_Brihadisvara_Temple%2C_Thanjavur.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/8b/Big_temple_064.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/9/9e/Big_temple_100.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/c/c9/Le_temple_de_Brihadishwara_%28Tanjore%2C_Inde%29_%2813908795928%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/e/e7/Chandeshvara_shrine_at_the_Brihadisvara_Temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/4c/1010_CE_Brihadishwara_Temple%2C_Hindu_god_Shiva%2C_built_by_Rajaraja_I%2C_Thanjavur_Tamil_Nadu_India_%288%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/df/1010_CE_Brihadishwara_Shiva_Temple%2C_yogini%2C_built_by_Rajaraja_I%2C_Thanjavur_Tamil_Nadu_India.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/6/6e/Tanjore_Paintings_-_Big_temple_01.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/2/25/Big_temple_061.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/2/21/1010_CE_Brihadishwara_Shiva_Temple%2C_wall_relief%2C_built_by_Rajaraja_I%2C_Thanjavur_Tamil_Nadu_India.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/1/1d/Brihadeeswarar_Temple_3407.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/df/Nandi_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/3/3a/Sculpture2_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/09/Sculpture3_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/d6/Relief_Staircase%2C_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/3/30/Relief_detail%2C_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/e/e6/Relief_detail_2_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/7/7f/Entrance_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/f/f7/Thanjavur_Big_Temple_View.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/e/e4/Left_side_view_Brihadeeswara.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/c/c0/PeriyaKoil_June_2016.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/0f/A_yoga_and_meditation_relief.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/e/e6/Ta-scr.jpg"
      ],
      "tag": [
        ""
      ]
    },
    {
      "basic": {
        "name": "Kailasa Temple",
        "bio": "The Kailasha  or Kailashanatha  temple is the largest of the rock-cut Hindu temples at the Ellora Caves near Chhatrapati Sambhaji Maharaj Nagar district of Maharashtra, India.",
        "location": {
          "pin": "Ellora Caves",
          "dist": "Shambhaji Nagar District",
          "state": "Maharashtra",
          "iframe": "https://www.mappls.com/c3oh2h"
        },
        "coordinates": {
          "x": 20.023889,
          "y": 75.179167
        },
        "website": ""
      },
      "Architecture": {
        "style": "Dravidian architecture",
        "creator": "\t\tKrishna I , Rashtrakuta Empire",
        "completed": "756–773 CE",
        "inscriptions": "\tNone",
        "elevation": 637
      },
      "about": {
        "basic_info": "     The Kailasha  or Kailashanatha  temple is the largest of the rock-cut Hindu temples at the Ellora Caves near Chhatrapati Sambhaji Maharaj Nagar district of Maharashtra, India. A megalith carved from a rock cliff face, it is considered as one of the most remarkable cave temples in the world because of its size, architecture and sculptural treatment, and 'the climax of the rock-cut phase of Indian architecture'. The top of the superstructure over the sanctuary is 32.6 metres (107 ft) above the level of the court below, although the rock face slopes downwards from the rear of the temple to the front. Archaeologists believe it is made from a single rock.The Kailasa temple (Cave 16) is the largest of the 34 Hindu, Buddhist, and Jain cave temples and monasteries known collectively as the Ellora Caves, ranging for over two kilometres (1.2 mi) along the sloping basalt cliff at the site. Most of the excavation of the temple is generally attributed to the eighth century Rashtrakuta king Krishna I ( 756 – 773 CE), with some elements completed later. The temple architecture shows traces of Pallava and Chalukya styles. The temple contains a number of relief and free-standing sculptures on a grand scale equal to the architecture, though only traces remain of the paintings which originally decorated it.",
        "history": "Kailasa temple lacks a dedicatory inscription, but there is no doubt that it was commissioned by a Rashtrakuta ruler. Its construction is generally attributed to the Rashtrakuta king Krishna I ( 756-773 CE), based on two epigraphs that link the temple to 'Krishnaraja' (Kṛṣṇarāja):The Vadodara copper-plate inscription (c. 812-813 CE) of Karkaraja II (a ruler of a Rashtrakuta branch of Gujarat) records the grant of a village in present-day Gujarat. It mentions Krishnaraja as the patron of Kailasanatha, and also mentions a Shiva temple at Elapura (Ellora). It states that the king constructed a temple so wondrous that even the gods and the architect were astonished. Most scholars believe that this is a reference to the Kailasanatha Shiva temple at Ellora.The Kadaba grant of Govinda Prabhutavarsha similarly appears to credit Krishnaraja with the construction of the temple.However, the attribution of the temple to Krishna I is not completely certain because these epigraphs are not physically connected to the caves, and do not date Krishnaraja's reign. Moreover, the land grants issued by Krishna's successors do not contain any references to the Kailasa temple .The Kailasa temple features the use of multiple distinct architectural and sculptural styles. This, combined with its relatively large size, has led some scholars to believe that its construction spanned the reigns of multiple kings. Some of the temple reliefs feature the same style as the one used in the Dashavatara cave (Cave 15), which is located next to the temple. The Dashavatara cave contains an inscription of Krishna's predecessor and nephew Dantidurga (c. 735–756 CE). Based on this, art historian Hermann Goetz (1952) theorized that the construction of the Kailasa temple began during the reign of Dantidurga. Krishna consecrated its first complete version, which was much smaller than the present-day temple. According to Goetz, Dantidurga's role in the temple construction must have been deliberately suppressed, as Krishna sidelined Dantidurga's sons to claim the throne after his death. Based on analysis of the different styles, Goetz further hypothesized that the later Rashtrakuta rulers also extended the temple. These rulers include Dhruva Dharavarsha, Govinda III, Amoghavarsha, and Krishna III. According to Goetz, the 11th century Paramara ruler Bhoja commissioned the elephant-lion frieze on the lower plinth during his invasion of Deccan, and added a new layer of paintings. Finally, Ahilyabai Holkar commissioned the last layer of paintings in the temple.M. K. Dhavalikar (1982) analyzed the architecture of the temple, and concluded that the major part of the temple was completed during the reign of Krishna I, although he agreed with Goetz that some other parts of the temple complex can be dated to the later rulers. According to Dhavalikar, the following components were completed by Krishna: the main shrine, its gateway, the nandi-mandapa, the lower-storey, the elephant-lion frieze, the court elephants and the victory pillars.Dhavalikar admits that the most important sculpture of the temple, which depicts Ravana shaking the Kailasa mountain, appears to have been built after the main edifice. This sculpture is considered one of the finest pieces of Indian art, and it is possible that the temple came to be known as Kailasa after it. Dhavalikar theorizes that this sculpture was carved around 3-4 decades after the completion of the main shrine, on the basis of its similarity to the tandava sculpture in the Lankeshvar cave. H. Goetz dated this relief to the reign of Krishna III. Like Goetz, Dhavalikar attributes some other structures in the temple complex to the later rulers. These include the Lankeshvar cave and the shrine of the river goddesses (possibly constructed during the reign of Govinda III). Dhavalikar further theorizes that the excavation of the Dashavatara cave, which began during the reign of Dantidurga, was completed during the reign of Krishna I. This explains the similarities between the sculptures in the two caves.",
        "architecture": "The Kailasa temple architecture is different from the earlier style prevalent in the Deccan region. As stated above, it appears to be based on the Virupaksha Temple at Pattadakal and the Kailasa temple at Kanchi, but it is not an exact imitation of these two temples. The southern influence on the temple architecture can be attributed to the involvement of Chalukya and Pallava artists in its construction. The indigenous Deccan artisans appear to have played a subordinate role in the temple's construction.The entrance to the temple courtyard features a low gopuram. Most of the deities at the left of the entrance are Shaivaite (affiliated with Shiva) while on the right hand side the deities are Vaishnavaites (affiliated with Vishnu). A two-storeyed gateway opens to reveal a U-shaped courtyard. The dimensions of the courtyard are 82 m x 46 m at the base.The courtyard is edged by a columned arcade three stories high. The arcades are punctuated by huge sculpted panels, and alcoves containing enormous sculptures of a variety of deities. Originally flying bridges of stone connected these galleries to central temple structures, but these have fallen. Some of the most famous sculptures are Shiva the ascetic, Shiva the dancer, Shiva being warned by Parvati about the demon Ravana, and river goddess. Within the courtyard, there is a central shrine dedicated to Shiva, and an image of his mount Nandi (the sacred bull). The central shrine housing the lingam features a flat-roofed mandapa supported by 16 pillars, and a Dravidian shikhara. The shrine – complete with pillars, windows, inner and outer rooms, gathering halls, and an enormous stone lingam at its heart – is carved with niches, plasters, windows as well as images of deities, mithunas (erotic male and female figures) and other figures. As is traditional in Shiva temples, Nandi sits on a porch in front of the central temple. The Nandi mandapa and main Shiva temple are each about 7 metres high, and built on two storeys. The lower stories of the Nandi Mandapa are both solid structures, decorated with elaborate illustrative carvings. The base of the temple has been carved to suggest that elephants are holding the structure aloft. A rock bridge connects the Nandi Mandapa to the porch of the temple. The base of the temple hall features scenes from Mahabharata and Ramayana.There are five detached shrines in the temple premises; three of these are dedicated to the river goddesses: Ganga, Yamuna and Saraswati.There are two Dwajasthambams (pillars with flagstaff) in the courtyard. A notable sculpture is that of the Ravana attempting to lift Mount Kailasa."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/en/f/fc/Kailash_temple_%28Ellora_cave_no_15%29_at_Verul.png",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Aurangabad%2Cellora_kailash_temple.jpg"
      },
      "trip": {
        "best_time": "June and March",
        "nearest_road": "The nearest city to the temple is Kailash temple and is well connected with the temple via road. . Also, the \tShambhaji Nagar city is properly connected with major cities like Satara, Pune, Nashik, Mumbai, Ahmednagar and Kolhapur.",
        "nearest_railway": "The nearest railway station to the temple is the \tShambhaji Nagar railway station. The distance between the temple and the \tShambhaji Nagar railway station is around 30kms",
        "by_air": " \tShambhaji Nagar airport is located at around 15 kms from the Kailash temple and is the closest airport to the Kailash temple. The city of Maharashtra in India is very well-connected to the \tShambhaji Nagar airport.",
        "festivals": "No details available"
      },
      "contact": {
        "address": "Ellora, Verul,Chhatrapati Sambhaji Maharaj Nagar, Maharashtra 431102",
        "phone": "Not available"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/8/87/Kailasha_temple_at_ellora.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/8/88/Kailasa_temple_overview%2C_Ellora.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/8b/Ellora_Caves_-_panoramio_%284%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/1/15/Ellora_cave16_001.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/b/b1/The_Kaila%C5%9Ba_temple%2C_Cave_16.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/dd/Ellora_Cave_16_si0300.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/2/22/Mahabharata_relief_panel_at_Kailasha_temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/2/27/Ellora-10-Kailasa-Tempel-Skulpturengruppe-1976-gje.jpg"
      ],
      "tag": [
        ""
      ]
    },
    {
      "basic": {
        "name": "Kotappakonda",
        "bio": "Kotappakonda is a holy hill, situated in Palnadu district, Andhra Pradesh, India. It is located 20 kilometers from Narasaraopet city and 62 kilometers south west of Guntur City.",
        "location": {
          "pin": "Kotappakonda",
          "dist": "Palnadu",
          "state": "Andhra Pradesh",
          "iframe": "https://www.mappls.com/c3oh2h"
        },
        "coordinates": {
          "x": 16.1448,
          "y": 80.0395
        },
        "website": ""
      },
      "Architecture": {
        "style": "Chola architecture",
        "creator": " Velanati Chola king Kulottunga Chola",
        "completed": "1172 A.D",
        "inscriptions": "Telugu",
        "elevation": 484
      },
      "about": {
        "basic_info": "     Kotappakonda Sri Trikoteswara Swamy Temple is a revered Hindu temple located in Kotappakonda, a small town in the Guntur district of Andhra Pradesh, India. The temple is dedicated to Lord Shiva, and is one of the most important pilgrimage centers for Shaivites in the region. It is believed that the temple was built during the 2nd century BC, during the Satavahana dynasty, and has since undergone several renovations and reconstructions.",
        "history": "Celebrated with great devotion and fervor every year with a large number of devotees thronging the place, Kotappakonda has an interesting history and some incredible facts associated with it.Trikuta Hills: Kotappa Konda hill appears with 3 peaks in any direction so it's also called as Trikutadri, Trikuta Parvatham. The three hills are Brahma hill, Vishnu hill and Rudra hill. These 3 hills can be distinctly seen from a distance from any direction.Brahma Shikharam: The main temple Trikoteswara Swamy Temple is located here.Rudra Shikharam: Old Kotayya temple is located here. This is the first place where Trikoteswara Swamy existed, seeing the great devotion of Devotee Gollabhama, Trikoteswara Swamy came to Brahma Shikharam. Hence it is called Paatha (old) Kotayya Temple.Vishnu Shikharam: Lord Paapanaseswara Temple is here. It is believed that Lord Vishnu did penance for Lord Shiva. There is also a holy pond 'Paapanasa Teertha' here.Sundudu, a cattleman, with his wife Kundiri used to live towards the south of the Trikuta hills. They became rich soon after the birth of their first child, a beautiful daughter, Anandavalli(Gollabhama). Slowly she became a great devotee of Lord Shiva and started spending most of her time offering prayers to Lord Shiva at the Old Koteswara Temple located on Rudra hill. Eventually, she lost all interest in her materialistic life and started penance for Sri Koteswara Swamy.She used to visit Rudra hill every day, even during the scorching summer, to offer prayers to the Lord. Pleased with her penance, Jangama Devara appeared before her. Sympathized by her penance, Jangama Devara blessed her to be a pregnant, though she was a spinster. Unmindful of her pregnancy she carried her daily prayers as usual. Stupefied at her deep devotion, he again appeared and told her that she need not take so many troubles to perform pujas and offer prayers, and promised her that he himself would come to her house where she could do her penance and commanded her to proceed towards her home, and that he would follow her, but advised her not to look back even once on her way to home, in spite of whatever happens.From Rudra hill, Anandavalli proceeded towards her home and after reaching Brahma hill, she lost her patience and turned back. The moment she turned back, breaking the promise she made, Lord Jangama Devara immediately stopped where he was, at Brahma hills and entered into a cave on that hill and turned himself into a Lingam. This sacred placed is famous by the name New Koteswara Temple. She then realized that her pregnancy was the creation of him, to test her devotion towards him. She felt happy as she got through all the critical trails and became one in the God.Every Year great festival is held in this Temple, which is known as Tirunallu It is one of the Biggest tirunalla in India The festival takes place on the day of Mahashivaratri. Lakhs of people take part in this festival peoples are came from all over the Telug states. In the festival night Cultural activities also held on the prabha's (prabha is like a triangle shape arrangement constructed by long tree sticks) prabha's came from several villages near kotappakoda.Prabha's are the main attraction of the festival.",
        "architecture": "The Kotappakonda Sri Trikoteswara Swamy Temple is a magnificent example of Dravidian and Buddhist architectural styles. The temple is built entirely of stone, and features intricate carvings of deities, animals, and mythical creatures. The temple complex is spread over several acres, and consists of several sub-shrines, halls, and other structures.The most striking feature of the temple is its Gopuram, or tower, which stands at the entrance to the temple complex. The Gopuram is about 35 meters tall, and is adorned with elaborate carvings and sculptures of gods and goddesses. The tower is divided into several tiers, each of which has its own unique features and designs.The main sanctum of the temple houses the lingam, or the phallic symbol of Lord Shiva. The sanctum is surrounded by a pradakshina path, which is a circumambulatory path that devotees use to offer their prayers. The lingam is bathed in holy water and decorated with flowers and other offerings by the priests.The temple also has several sub-shrines, each of which is dedicated to a specific deity or celestial being. Some of the most prominent sub-shrines include those dedicated to Lord Subramanya, Goddess Parvati, Lord Ganesha, and Lord Hanuman. Each sub-shrine has its own unique architecture and design, reflecting the diverse cultural influences that have shaped the temple over the centuries.One of the most striking features of the temple complex is the Mukha Mandapam, which is a large hall that is used for conducting various rituals and ceremonies. The hall is supported by several intricately carved pillars, and features elaborate carvings of gods and goddesses on its walls and ceiling. The hall is also used for conducting cultural programs and performances, particularly during festival times."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/6/65/Kotappa_konda_4.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/6/65/Kotappa_konda_4.jpg"
      },
      "trip": {
        "best_time": "June and March",
        "nearest_road": "The temple is located about 20 km from Narasaraopet, and about 45 km from Guntur. The temple is well-connected by road, and there are several bus services that operate to and from the temple. Visitors can also hire taxis or private cars to reach the temple.",
        "nearest_railway": "The nearest railway station to the temple is Narasaraopet railway station, which is located about 20 km from the temple. There are several trains that run to and from Narasaraopet, connecting it to major cities like Hyderabad, Chennai, and Bangalore. Visitors can take a taxi or bus from the railway station to reach the temple.",
        "by_air": " \tThe nearest airport to the temple is the Vijayawada Airport, which is located about 90 km from the temple. The airport is well-connected to major cities in India, including Delhi, Mumbai, Bangalore, and Chennai. Visitors can hire a taxi or take a bus from the airport to reach the temple.",
        "festivals": "Maha Shivaratri: This is the most important festival celebrated at the temple, and is dedicated to Lord Shiva. It is celebrated in the month of February or March, and attracts thousands of devotees from all over the country. The festival is marked by the chanting of mantras, the offering of prayers, and the performance of various rituals and ceremonies.Navaratri: This is a nine-day festival celebrated in the months of September or October, and is dedicated to the worship of the divine feminine energy, or Shakti. The festival is marked by the offering of prayers, the lighting of lamps, and the performance of cultural programs and performances.Vinayaka Chaturthi: This festival is dedicated to Lord Ganesha, and is celebrated in the month of August or September. The festival is marked by the installation of idols of Lord Ganesha, the offering of prayers, and the performance of various rituals and ceremonies.Karthika Masam: This is a month-long festival celebrated in the month of November, and is considered a very auspicious time for worship and devotion. The festival is marked by the offering of prayers, the lighting of lamps, and the performance of various rituals and ceremonies."
      },
      "contact": {
        "address": "Ellora, Verul,Chhatrapati Sambhaji Maharaj Nagar, Maharashtra 431102",
        "phone": "Not available"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/6/65/Kotappa_konda_4.jpg"
      ],
      "tag": [
        ""
      ]
    },
    {
      "basic": {
        "name": "Somnath Jyotirlinga",
        "bio": "The Somnath temple, also called Somanātha temple or Deo Patan, is a Hindu temple located in Prabhas Patan, Veraval in Gujarat, India. It is one of the most sacred pilgrimage sites for Hindus and is the first among the twelve jyotirlinga shrines of Shiva",
        "location": {
          "pin": " Prabhas Patan",
          "dist": " Veraval",
          "state": " Gujarat",
          "iframe": "https://www.mappls.com/2s4a75"
        },
        "coordinates": {
          "x": 20.888028,
          "y": 70.401389
        },
        "website": "https://somnath.org/"
      },
      "Architecture": {
        "style": "Chalukya architectural pattern",
        "creator": "The Chaulukya (Solanki) king Mularaja",
        "completed": " 997 CE",
        "inscriptions": "None",
        "elevation": 7
      },
      "about": {
        "basic_info": "      The Somnath temple, also called Somanātha temple or Deo Patan, is a Hindu temple located in Prabhas Patan, Veraval in Gujarat, India. It is one of the most sacred pilgrimage sites for Hindus and is the first among the twelve jyotirlinga shrines of Shiva. It is unclear when the first version of the Somnath temple was built with estimates varying between the early centuries of the 1st-millennium to about the 9th-century CE. The temple is not mentioned in ancient Sanskrit texts of Hinduism as Somnath nomenclature but the 'Prabhasa-Pattana' (Prabhas Patan) is mentioned as a tirtha (pilgrimage site), where this temple exists. For example, the Mahabharata in Chapters 109, 118 and 119 of the Book Three (Vana Parva), and Sections 10.45 and 10.78 of the Bhagavata Purana state Prabhasa to be a tirtha on the coastline of Saurashtra.The temple was reconstructed several times in the past after repeated destruction by multiple Muslim invaders and rulers, notably starting from an attack by Mahmud Ghazni in the 11th century.The Somnath temple was actively studied by colonial era historians and archaeologists in the 19th- and early 20th-century, when its ruins illustrated a historic Hindu temple in the process of being converted into an Islamic mosque. After India's independence, those ruins were demolished and the present Somnath temple was reconstructed in the Māru-Gurjara style of Hindu temple architecture. The contemporary Somnath temple's reconstruction was started under the orders of the first Deputy Prime Minister of India Vallabhbhai Patel after receiving approval for reconstruction from Mahatma Gandhi. The reconstruction was completed in May 1951 after his death.The Somnath temple is located along the coastline in Prabhas Patan, Veraval, Saurashtra region of Gujarat. It is about 400 kilometres (249 mi) southwest of Ahmedabad, 82 kilometres (51 mi) south of Junagadh – another major archaeological and pilgrimage site in Gujarat. It is about 7 kilometres (4 mi) southeast of the Veraval railway junction, about 130 kilometres (81 mi) southeast of the Porbandar airport and about 85 kilometres (53 mi) west of the Diu airport.The Somnath temple is located close to the ancient trading port of Veraval, one of three in Gujarat from where Indian merchants departed to trade goods. The 11th-century Persian historian Al-Biruni states that Somnath has become so famous because it was the harbor for seafaring people, and a station for those who went to and fro between Sufala in the country of Zanj (east Africa) and China. Combined with its repute as an eminent pilgrimage site, its location was well known to the kingdoms within the Indian subcontinent. Literature and epigraphical evidence suggests that the medieval era Veraval port was also actively trading with the Middle East and Southeast Asia. This brought wealth and fame to the Veraval area as well as the temple.The site of Prabhas Patan was occupied during the Indus Valley Civilisation, 2000–1200 BCE. It was one of very few sites in the Junagadh district to be so occupied. After abandonment in 1200 BCE, it was reoccupied in 400 BCE and continued into the historical period. Prabhas is also close to the other sites similarly occupied: Junagadh, Dwarka, Padri and Bharuch.Somnath means 'Lord of the Soma' or 'moon'. The site is also called Prabhasa ('place of splendor'). Somnath temple has been a jyotirlinga site for the Hindus, and a holy place of pilgrimage (tirtha ). It is one of five most revered sites on the seacoast of India, along with the nearby Dvaraka in Gujarat, Puri in Odisha, Rameshvaram and Chidambaram in Tamil Nadu.        Many Hindu texts provide a list of the most sacred Shiva pilgrimage sites, along with a guide for visiting the site. The best known were the Mahatmya genre of texts. Of these, Somnatha temple tops the list of jyotirlingas in the Jnanasamhita – chapter 13 of the Shiva Purana, and the oldest known text with a list of jyotirlingas. Other texts include the Varanasi Mahatmya (found in Skanda Purana), the Shatarudra Samhita and the Kothirudra Samhita. All either directly mention the Somnath temple as the number one of twelve sites, or call the top temple as 'Somesvara' in Saurashtra – a synonymous term for this site in these texts. The exact date of these texts is unknown, but based on references they make to other texts and ancient poets or scholars, these have been generally dated between the 10th- and 12th-century, with some dating it much earlier and others a bit later",
        "history": "Skanda Purana, in a chapter on Prabhasa Khanda, describes the emergence of this Jyotirlinga. Legend goes that the moon was married to the 27 daughters of Daksha Prajapati. Amongst all his wives, he had special love towards Rohini and neglected the others. Seeing the negligence of Chandra towards his other wives Prajapati Daksha cursed Chandra that he would lose his beauty and radiance. But because of a moon devoid of radiance and beauty the entire world became lifeless. A disturbed Chandra, came down to Prabhasa with Rohini and worshipped the Sparsa Linga of Somnath after which he was blessed by Shiva to grow and shine in the bright half. As the moon regained his light here, this town came to be known as Prabhasa. Brahma, one of the trinity, installed the Brahmashila, and paved way for the construction of the temple. On the request of the Chandrama and other gods Bhagwan Shankar assumed the name Somchandra (Jyotirlinga) and resided there eternally. He became famous by the name Somnath in the three worlds. Since, it was the Prabhas Kshetra where Bhagwan Shri Krishna performed all his Lilas. In this temple there is a small cave in which a lamp burns continuously.The site of Somnath has been a pilgrimage site from ancient times on account of being a Triveni Sangam (the confluence of three rivers: Kapila, Hiran and Saraswati). Soma, the Moon god, is believed to have lost his lustre due to a curse, and he bathed in the Sarasvati River at this site to regain it. The result is said to be the waxing and waning of the moon. The name of the town, Prabhas, meaning lustre, as well as the alternative names Someshvar and Somnath ('the lord of the moon' or 'the moon god'), arise from this tradition.The name Someshvara begins to appear starting in the 9th century. The Gurjara-Pratihara king Nagabhata II (r. 805–833) recorded that he has visited tirthas in Saurashtra, including Someshvara. Romila Thapar states that this does not imply the existence of a temple, but rather that it was a pilgrimage site (tirtha). The Chaulukya (Solanki) king Mularaja possibly built the first temple for Soma at the site sometime before 997 CE, even though some historians believe that he may have renovated a smaller earlier temple.The post-1950 excavations of the Somnath site have unearthed the earliest known version of the Somnath temple. The excavations showed the foundations of a 10th-century temple, notable broken parts and details of a major, well decorated version of a temple. Madhusudan Dhaky believes it to have been the one that was destroyed by Mahmud of Ghazni. B.K. Thapar, the archaeologist who did the excavation, stated that there was definitely a temple structure at Somnath-Patan in the 9th-century, but none before.In 1026, during the reign of Bhima I, the Turkic Muslim ruler Mahmud of Ghazni raided and plundered the Somnath temple, broke its jyotirlinga. He took away a booty of 20 million dinars. According to Romila Thapar, relying on a 1038 inscription of a Kadamba king of Goa, the condition of Somnath temple in 1026 after Ghazni's is unclear because the inscription is 'puzzlingly silent' about Ghazni's raid or temple's condition. This inscription, states Thapar, could suggest that instead of destruction it may have been a desecration because the temple seems to have been repaired quickly within twelve years and was an active pilgrimage site by 1038.        The raid of 1026 by Mahmud is confirmed by the 11th-century Persian historian Al-Biruni, who worked in the court of Mahmud, who accompanied Mahmud's troops between 1017 and 1030 CE on some occasions, and who lived in the northwest Indian subcontinent region – over regular intervals, though not continuously. The invasion of Somnath site in 1026 CE is also confirmed by other Islamic historians such as Gardizi, Ibn Zafir and Ibn al-Athir. However, two Persian sources – one by adh-Dhahabi and other by al-Yafi'i – state it as 1027 CE, which is likely incorrect and late by a year, according to Khan – a scholar known for his studies on Al-Biruni and other Persian historians. Al-Biruni states that Mahmud destroyed the Somnath temple. He states Mahmud's motives as, raids undertaken with a view to plunder and to satisfy the righteous iconoclasm of a true Muslim... [he] returned to Ghazna laden with costly spoils from the Hindu temples. Al-Biruni obliquely criticizes these raids for ruining the prosperity of India, creating antagonism among the Hindus for all foreigners, and triggering an exodus of scholars of Hindu sciences far away from regions conquered by us. Mahmud launched many plunder campaigns into India, including one that included the sack of Somnath temple.According to Jamal Malik – a South Asian history and Islamic Studies scholar, the destruction of Somnath temple, a well known place of pilgrimage in Gujarat in 1026, played a major role in creating Mahmud as an icon of Islam, the sack of this temple became a crucial topic in Persian stories of Islamic iconoclasm. Many Muslim historians and scholars in and after the 11th-century included the destruction of Somnath as a righteous exemplary deed in their publications. It inspired the Persian side with a cultural memory of Somnath's destruction through epics of conquest, while to the Hindu side, Somnath inspired tales of recovery, rebuilding and epics of resistance.These tales and chronicles in Persia elevated Mahmud as the exemplary hero and Islamic warrior for the Muslims, states Malik, while in India Mahmud emerged as the exemplary arch-enemy.",
        "architecture": "The floor plan and ruins of a pre-1000 CE temple were unearthed during the archaeological excavations led by B.K. Thapar. Most of the temple is lost, but the remains of the foundation, the lower structure as well as pieces of the temple ruins suggest an exquisitely carved, rich temple. According to Dhaky – a scholar of Indian temple architecture, this is the earliest known version of the Somnath temple. It was, what historic Sanskrit vastu sastra texts call the tri-anga sandhara prasada. Its garbhagriha (sanctum) was connected to a mukhamandapa (entrance hall) and gudhamandapa.The temple opened to the east. The stylobate of this destroyed temple had two parts: the 3 feet high pitha-socle and the vedibandha-podium. The pitha had a tall bhitta, joined to the jadyakumbha, ornamented with what Dhaky calls crisp and charming foliage pattern. The kumbha of the Vedibandha had a Surasenaka with a niche that contained the figure of Lakulisa – this evidence affirms that the lost temple was a Shiva temple.The excavations yielded pieces of one at the western end, which suggests that the kumbhas were aligned to the entire wall. Above the kalaga moulding was an antarapatta, states Dhaky, but no information is available to determine its design or ornamentation. The surviving fragment of the kapotapali that was discovered suggests that at intervals, it was decorated with contra-posed half thakaras, with large, elegant, and carefully shaped gagarakas in suspension graced the lower edge of the kapotapali, states Dhaky. The garbhagriha had a vedibandha, possibly with a two-layered jangha with images on the main face showing the influence of the late Maha-Maru style. Another fragment found had a beautifully moulded rounded pillarette and a ribbed khuraccadya-awning topped the khattaka.The mukhachatuski, states Dhaky, likely broke and fell immediately after the destructive hit by Mahmud's troops. These fragments suffered no further erosion or damage one would normally expect, likely because it was left in the foundation pit of the new Somnath temple that was rebuilt quickly after Mahmud left. The quality of craftsmanship in these fragments is 'indeed high', the carvings of the lost temple were rich and exquisite, states Dhaky. Further, a few pieces have an inscription fragment in the 10th-century characters – which suggests that this part of the temple or the entire temple was built in the 10th-century.The present temple is a Māru-Gurjara architecture (also called Chaulukya or Solanki style) temple. It has a Kailash Mahameru Prasad form, and reflects the skill of the Sompura Salats, one of Gujarat's master masons.The architect of the new Somnath temple was Prabhashankarbhai Oghadbhai Sompura, who worked on recovering and integrating the old recoverable parts with the new design in the late 1940s and early 1950s. The new Somnath temple is intricately carved, two level temple with pillared mandapa and 212 relief panels.The temple's śikhara, or main spire, is 15 metres (49 ft) in height above the sanctum, and it has an 8.2-metre-tall flag pole at the top. According to Ananda Coomaraswamy – an art and architecture historian, the earlier Somnath temple ruin followed the Solanki-style, which is Nagara architecture inspired by the Vesara ideas found in Western regions of India."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/a/ac/Somanath_Temple.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Somanath_mandir.jpg"
      },
      "trip": {
        "best_time": "November to February",
        "nearest_road": "A good network of roads connects Somnath to the different important places in the state of Gujarat. The state capital Ahmedabad is 400 km away; Junagadh, Bhavnagar and Porbandar are at a distance of 85, 266 and 122 km respectively but all of them are well linked to Somnath by roads and buses ply on these road routes.",
        "nearest_railway": "Veraval is the nearest rail head which is merely 7 km from Somnath. A special train 'Somnath Express' runs from Ahmedabad to Veraval. Ahmedabad is the state capital of Gujarat and is well linked by rail not only to different places in the state of Gujarat but also to many of the prime cities in India.",
        "by_air": "The nearest airport is Keshod. Located at a distance of about 55 km from Somnath, this domestic airport is well connected to Mumbai. There are flights at regular intervals from Mumbai to Keshod.",
        "festivals": "Maha Shivaratri (February or March) and Karthik (November to December) Purnima is celebrated in the temple with full fervour and enthusiasm."
      },
      "contact": {
        "address": "Somnath Mandir Rd, Somnath, Prabhas Patan, Gujarat 362268",
        "phone": "9428214914"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/a/ac/Somanath_Temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/d7/Somanath_mandir.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/a2/2015_Somnath_Jyotirlinga_temple_Prabhas_Patan.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/f/f2/Somnath_temple_ruins_%281869%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/c/c1/Somnath_temple_Prabhas_Veraval_Gujarat%2C_artwork_1_with_captions.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/c/ce/Somnathtempledawn.JPG"
      ],
      "tag": [
        "Jyotirlinga",
        "1"
      ]
    },
    {
      "basic": {
        "name": "Mallikarjuna Jyotirlinga",
        "bio": "Mallikarjun Temple is situated on Shri Shaila Mountain by the banks of the Patal Ganga, Krishna River in the southern state of Andhra Pradesh. Also known as Kailash of the South, Mallikarjuna constitutes one of the 12 Jyotirlingam shrines of Shiva and is one of the greatest Shaivaite shrines in India.",
        "location": {
          "pin": " Srisailam",
          "dist": " \tNandyala",
          "state": " Andhra Pradesh",
          "iframe": "https://www.mappls.com/ss2557"
        },
        "coordinates": {
          "x": 16.074167,
          "y": 78.868056
        },
        "website": "https://www.srisailadevasthanam.org/en-in/home"
      },
      "Architecture": {
        "style": "Dravidian style,Vijayanagar architecture.",
        "creator": "Queen Loka Mahadevi(wife of King Vikramaditya II)",
        "completed": " 740 A.D.",
        "inscriptions": "None",
        "elevation": 457
      },
      "about": {
        "basic_info": "      Sri Bhramaramba Mallikarjuna Temple or Srisailam Temple is a Hindu temple dedicated to the deities Shiva and Parvati, located at Srisailam in the Indian state of Andhra Pradesh.It is significant to the Hindu sects of both Shaivism and Shaktism as this temple is referred to as one of the twelve Jyotirlingas of Shiva and as one of the eighteen Shakti Peethas, centres of the Hindu Goddess. Shiva is worshiped as Mallikarjuna, and is represented by the lingam. His consort Parvati is depicted as Bhramaramba.Srisailam Sri Mallikarjuna Swamy Temple is located around 180 kilometers from the Kurnool district headquarters, and 213 kilometers from Hyderabad. Pilgrims coming by train would need to alight at the railway station in either Markapur or Tarlupadu. These stations are between 2 and 2.5 hours by road. The Kacheguda-Guntur passenger passes through the Giddalur railway station that is 139 kilometers from the temple",
        "history": "Sri Bhramaramba Mallikarjuna Temple or Srisailam Temple is a Hindu temple dedicated to the deities Shiva and Parvati, located at Srisailam in the Indian state of Andhra Pradesh.It is significant to the Hindu sects of both Shaivism and Shaktism as this temple is referred to as one of the twelve Jyotirlingas of Shiva and as one of the eighteen Shakti Peethas, centres of the Hindu Goddess. Shiva is worshiped as Mallikarjuna, and is represented by the lingam. His consort Parvati is depicted as Bhramaramba.There are inscriptional evidence from the Satavahana dynasty which place the temple to be existent from the 2nd century. Most modern additions were done during the time of king Harihara I of Vijayanagara Empire. The veerasheromandapam and paathalaganga steps was constructed during the time of Reddi Kingdom.",
        "architecture": "The temple complex covers 2 hectares and houses four gateway towers known as gopurams. The temple has numerous shrines, with those of Mallikarjuna and Bhramaramba being the most prominent. The temple complex houses many halls; the most notable is the Mukha Mandapa built during the Vijayanagar period. The temple is situated facing East. The center mandapam has several pillars, with a huge idol of Nadikeshwara. The temple is enclosed by tall walls measuring 183 m (600 ft) by 152 m (499 ft) and 8.5 m (28 ft) tall. There are a number of sculptures in the precinct each rising above another. The Mukamandapa, the hall leading to the sanctum, has intricately sculpted pillars. The shrine where Mallikarjuna is housed is considered the oldest in the temple, dating back to the 7th century. There is a Sahasra linga (1000 linga), believed to have been commissioned by Rama and five other lingams believed to have been commissioned by Pandavas. A mirror hall in the first precinct has images of Nataraja.Bhramaramba Shrine is Located adjacent to the Mallikarjun Temple is a shrine dedicated to Goddess Jagdamba who is known as Bhramaramba here. The Bhramaramba shrine is considered to be of great significance. Legend has it that Durga is said to have assumed the shape of a bee and worshipped Shiva here, and chose this place as her abode."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Srisailam.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Srisailam.jpg"
      },
      "trip": {
        "best_time": "November to February",
        "nearest_road": "From your city to Hyderabad. Hyderabad is the nearest major rail head. The Mallikarjuna Temple is located at Srisailam. The distance from Hyderabad to Sri Sailam is 240 kms by road.",
        "nearest_railway": "There is no railway station in the vicinity of Sri Bhramaramba Mallikarjuna Temple, however, there are few railway stations near to it. Let’s have a look at a few of these railway stations. ",
        "by_air": "The nearest airport to Mallikarjuna Jyotirlinga is Rajiv Gandhi International Airport, which is located at a distance of about 200 kilometers from Mallikarjuna Jyotirlinga. Rajiv Gandhi International Airport is connected to Delhi, Mumbai, Kolkata, Ahmedabad and Chandigarh as well as many other major and minor airports in the country.",
        "festivals": "Maha Shivaratri (February or March) and Karthik (November to December) Purnima is celebrated in the temple with full fervour and enthusiasm."
      },
      "contact": {
        "address": "Srisailam, Andhra Pradesh 528101",
        "phone": "8333901351"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/c/c0/Srisailam.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "2"
      ]
    },
    {
      "basic": {
        "name": "Mahakaleshwar Jyotirlinga",
        "bio": "Mahakaleshwar Jyotirlinga is a Hindu temple dedicated to Shiva and is one of the twelve Jyotirlingas, shrines which are said to be the most sacred abodes of Shiva. It is located in the ancient city of Ujjain in the state of Madhya Pradesh, India. The temple is situated on the side of the holy river Shipra. ",
        "location": {
          "pin": " Jaisinghpura",
          "dist": " \tUjjain",
          "state": " Madhya Pradesh",
          "iframe": "https://www.mappls.com/65tbft"
        },
        "coordinates": {
          "x": 23.182778,
          "y": 75.768333
        },
        "website": "https://shrimahakaleshwar.com/"
      },
      "Architecture": {
        "style": "Chalukya and Maratha ",
        "creator": "Prajapati Brahma ",
        "completed": "  Original date unknown",
        "inscriptions": "None",
        "elevation": 491
      },
      "about": {
        "basic_info": "      Mahakaleshwar Jyotirlinga is a Hindu temple dedicated to Shiva and is one of the twelve Jyotirlingas, shrines which are said to be the most sacred abodes of Shiva. It is located in the ancient city of Ujjain in the state of Madhya Pradesh, India. The temple is situated on the side of the holy river Shipra. The presiding deity, Shiva in the lingam form is believed to be Swayambhu, deriving currents of power (Shakti) from within itself as against the other images and lingams that are ritually established and invested with mantra-shakti.Madhya Pradesh has two Jyotirlingas, the second one, Omkareshwar Jyotirlinga, is situated about 140 km south of Mahakaleshwar Jyotirlinga.",
        "history": "According to the Puranas, the city of Ujjain was called Avantika and was famous for its beauty and its status as a devotional epicenter. It was also one of the primary cities where students went to study holy scriptures. According to legend, there was a ruler of Ujjain called Chandrasena, who was a pious devotee of Shiva and worshiped him all the time. One day, a farmer's boy named Shrikhar was walking on the grounds of the palace and heard the King chant the Shiva's name and rushed to the temple to start praying with him. However, the guards removed him by force and sent him to the outskirts of the city near the river Kshipra. Rivals of Ujjain, primarily King Ripudamana and King Singhaditya of the neighboring kingdoms decided to attack the Kingdom and take over its treasures around this time. Hearing this, Shrikhar started to pray and the news spread to a priest named Vridhi. He was shocked to hear this and upon the urgent pleas of his sons, started to pray to Shiva at the river Kshipra. The Kings chose to attack and were successful; with the help of the powerful demon Dushan, who was blessed by Brahma to be invisible, they plundered the city and attacked all the devotees of Shiva.Upon hearing the pleas of His helpless devotees, Shiva appeared in his Mahakala form and destroyed the enemies of King Chandrasena. Upon the request of his devotees Shrikhar and Vridhi, Shiva agreed to reside in the city and become the chief deity of the Kingdom and take care of it against its enemies and to protect all His devotees. From that day on, Shiva resided in His light form as Mahakala in a Lingam that was formed on its own from the powers of Shiva and his consort, Parvati. Shiva also blessed his devotees and declared that people who worshipped Him in this form would be free from the fear of death and diseases. Also, they would be granted worldly treasures and be under the protection of the Shiva himself.Bharthari was the elder son of King Gandharva-Sena, and received the kingdom of Ujjain from the celestial god Indra and the King of Dhara.When Bharthari was king of 'Ujjayani' (modern-day Ujjain) in his state there lived a Brahman who after years of austerities was given the fruit of immortality from the celestial tree of Kalpavriksha. The Brahman presented the same to his monarch, Raja Bharthari, who in turn, passed it on to his love, the beautiful, Pinglah Rani or Ananga Sena Raja Bhartrhari's last and youngest wife. The queen, being in love with the Head police officer of the state, Mahipaala, presented the fruit to him, who further passed it on to his beloved, Lakha, one of the maids of honour. Eventually, Lakha being in love with the king presented the fruit back to the king. Having completed the circle, the fruit revealed the downsides of infidelity to the king, he summoned the queen and ordered her beheading, and ate the fruit himself. After that, he abdicated the throne, and became a religious mendicant.He later became a disciple of Pattinatthar who first indulged in an argument about samsari and sanyasi with king Bhartrhari. Later during the conversation pattinathar said that all women have 'dual mind' and it might be the true case even with Parameswari. King conveyed this news to Rani Pingalah and she ordered Pattinathar to get punished and to sit in kalu maram (tree, whose top portion would be sharpened like a pencil and whole tree is fully coated with oil, a person who is punished to sit in the top will be split into two pieces), they tried to kill Pattinathar, but Kalu Maram started burning and nothing happened to Pattinathar, the king received the news and went directly to Pattinathar and asked him to get ready to die the next day, but Pattinathar replied, 'I'm ready right now, to die'. The next day king came with tears in his eyes and released saint from jail because he actually noticed Queen Pingalah in love with horsemen that night, He threw away his empire, wealth, even full coat dress and dressed in a simple kovanam (loincloth), the king became a disciple of Pattinatthar and got moksha (salvation) in the Srikalahasteeshwara Temple in Andhra Pradesh which houses the Vayu Lingam, a part of the Pancha Bhoota Sthalams of Shiva.Kalidasa, the great Sanskrit poet of the times who was probably a contemporary of king Pushyamitra Sunga, has mentioned about the rituals of the temple in his works in Meghadūta. He mentions about the nada-aradhana, the performance of art and dance during the evening rituals.The temple complex was destroyed by Iltutmish during his raid of Ujjain in 1234–35. The Jyotirlinga was dismantled and believed to be thrown into a nearby 'Kotiteerth Kunda' (a pond neighbouring the temple) with the Jaladhari (a structure supporting the Lingam) stolen during the invasion.The present structure was built by the Maratha general Ranoji Shinde in 1734 CE after Baji Rao I appointed him to collect taxes in malwa region. Further developments and management was done by other members of shinde dynasty, including Mahadji Shinde (1730 – 12 February 1794) and Daulat Rao Shinde's wife Baiza Bai. (1827–1863). During the reign of Jayajirao Shinde (until 1886), major programs of the then Gwalior State used to be held at this temple.The Maratha Empire regime was established in Ujjain in the 4th decade of the 18th century. The administration of Ujjain was assigned by Peshwa Bajirao-I to his faithful commander Ranoji Shinde, the Diwan of Ranoji was Sukhatanakar Ramchandra Baba Shenavi who was very wealthy he decided to invest his wealth for religious purposes. In this connection, he re-built the Mahakaleshwar Temple during the 4th and 5th decades of the 18th century.After India became independent in 1947, the Mahakaleshwar Dev Sthan Trust was replaced by the municipal corporation of Ujjain. Nowadays it is under the collectorate office of Ujjain district.",
        "architecture": "The idol of Mahakaleshwar is known to be dakshinamukhi, which means that it is facing the south. This is a unique feature, upheld by the tantric shivnetra tradition to be found only in Mahakaleshwar among the 12 Jyotirlingas. The idol of Omkareshwar Mahadev is consecrated in the sanctum above the Mahakal shrine. The images of Ganesh, Parvati and Karttikeya are installed in the west, north, and east of the sanctum sanctorum. To the south is the image of Nandi, the vehicle of Shiva. The idol of Nagchandreshwar on the third storey is open for darshan only on the day of Nag Panchami. The temple has five levels, one of which is underground. The temple itself is located in a spacious courtyard surrounded by massive walls near a lake. The shikhar or the spire is adorned with sculptural finery. Brass lamps light the way to the underground sanctum. It is believed that prasada (holy offering) offered here to the deity can be re-offered unlike all other shrines.The presiding deity of time, Shiva, in all his splendor, reigns eternally in the city of Ujjain. The temple of Mahakaleshwar, its shikhar soaring into the sky, an imposing façade against the skyline, evokes primordial awe and reverence with its majesty. The Mahakal dominates the life of the city and its people, even in the midst of the busy routine of modern preoccupations, and provides an unbreakable link with ancient Hindu traditions.On the day of Maha Shivaratri, a huge fair is held near the temple, and worship goes on through the night.Devotees are not allowed to bring bags , mobile phones and cameras during the visit. Lockers and Cloak Rooms are there for devotees where they can keep their belongings.Also an awesome spectacle, with huge participation of devotees, is the procession of God Mahakaal in his Palanquin, called Shahi Savaari, to the river Kshipra, on last Monday of the holy period of Sawaan during the months of Shraavana or Bhadrapada.The Temple has a Shrine for Parvati known as avantika devi(goddess of ujjain city) behind the palki dwar at the back side of Ram Temple."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Mahakal_Temple_Ujjain.JPG",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Mahakal_Temple_Ujjain.JPG"
      },
      "trip": {
        "best_time": "October to March",
        "nearest_road": " Buses ply to the temple from Ujjain, which is well connected through road network to various cities close-by",
        "nearest_railway": " Book tickets to Ujjain railway station and from there reach the temple via bus or taxi",
        "by_air": "Get to the Devi Ahilyabai Holkar Airport Indore and then reach the temple by bus or taxi",
        "festivals": "In the month of Shravan-Bhado, Mahakaleshwar Baba rides out. It starts riding every Monday with the start of the month.Every year panchkroshi yatra takes place in ujjain which has great religious significance. Thousands of people come in city of.On the day of Mahashivaratri, a huge fair is held near the temple, Thousands of pilgrims flock to the fair grounds near the Mahakaleshwar temple and do their worship throughout the night.The Mahakaleshwar Jyotirlinga Bhasma aarti, which takes place every day at 4 am, is one of the main draws of Mahakaleshwar Mandir. The divine ceremony is applying holy ash that has been taken from the ghats to the idol while reciting religious chants"
      },
      "contact": {
        "address": "Jaisinghpura, Ujjain, Madhya Pradesh 456001",
        "phone": "7342550563"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/7/7d/Mahakal_Temple_Ujjain.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/b/ba/Sarayu_River_night_view%2C_Ayodhya_001.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "3"
      ]
    },
    {
      "basic": {
        "name": "Omkareshwar Jyotirlinga",
        "bio": "Omkareshwar is a Hindu temple dedicated to Shiva, located in Mandhata, nearby Khandwa city in Khandwa district of the Indian state of Madhya Pradesh. It is one of the 12 revered Jyotirlinga shrines of Shiva.",
        "location": {
          "pin": " \tMandhata",
          "dist": " \t Khandwa",
          "state": " Madhya Pradesh",
          "iframe": "https://www.mappls.com/ym796c"
        },
        "coordinates": {
          "x": 22.245583,
          "y": 76.151056
        },
        "website": "https://www.shriomkareshwar.org/"
      },
      "Architecture": {
        "style": " Nagara architecture style",
        "creator": "Shivaram Bhat ",
        "completed": " between 1740 and 1760",
        "inscriptions": "None",
        "elevation": 193
      },
      "about": {
        "basic_info": "      Omkareshwar (IAST: Ōṃkārēśvar) is a Hindu temple dedicated to Shiva, located in Mandhata, nearby Khandwa city in Khandwa district of the Indian state of Madhya Pradesh. It is one of the 12 revered Jyotirlinga shrines of Shiva. It is on an island called Mandhata, near Khandwa city in the Narmada river at Khandwa district in Madhya Pradesh, India; the shape of the island is said to be like the Devanagari ॐ symbol.There are two main temples of Shiva here, one to Omkareshwar (whose name means Lord of Omkara or the Lord of the Om sound) located in the island and one to Mamleshwar (Amaleshwar) (whose name means Immortal Lord or lord of the Immortals or Devas) located on the southern bank of the Narmada River on the mainland. Madhya Pradesh has two Jyotirlingas, the second one, Mahakaleshwar Jyotirlinga, is situated about 140 km north of Omkareshwar Jyotirlinga.It is situated in the Mandhata city (also known as Omkareshwar) in Khandwa district of Madhya Pradesh state in India. It is about 16 km from Barwaha in Madhya Pradesh. Omkareshwar is formed by the sacred river Narmada. This is one of the most sacred rivers in India and is now home to one of the world's biggest dam projects. The temple is situated on Mandhata or Shivpuri island on the banks of Narmada and Kaveri river (a tributary of Narmada). The island is 4 KM long and 2.6 km2 (2,600,000 m2) in area and can be approached by boats and bridge",
        "history": "As per Hindu legend, Vindhya, the deity controlling the Vindhyachal mountain range was worshipping Shiva to propitiate himself from the sins committed. He created a sacred geometrical diagram and a Lingam made of sand and clay. Shiva was pleased with the worship and believed to have appeared in two forms, namely Omkareshwar and Amaleswara. Since the mud mound appeared in the form of Om, the island came to be known as Omkareswar. There is a shrine for Parvati and Ganapati in the temple.The second story relates to Mandhata and his son's penance. King Mandhata of Ikshvaku clan (an ancestor of Ram) worshipped Shiva here until the Lord manifested himself as a Jyotirlinga. Some scholars also narrate the story about Mandhata's sons-Ambarish and Muchukunda, who had practiced severe penance and austerities here and pleased Shiva. Because of this, the mountain is named Mandhata.The third story from Hindu scriptures says that once upon a time there was a great war between Devas (gods) and Danavas (demons), in which Danavas won. This was a major setback for Devas and hence Devas prayed to Shiva. Pleased with their prayer, Shiva emerged in the form of Omkareshwar Jyotirlinga and defeated Danavas.Philosophy of Omkaar - Advait Matt says Omkaar is composed of two words, Om (sound) and Akaar (srishti). Both are one not two since Advait means'not two'. Om beej mantra of Srishti, itself is creator of Srishti.Adi Shankara's Cave – Omkareshwar is said to be the place where Adi Sankara met his guru Govinda Bhagavatpada in a cave. This cave can be found even today just below the Shiva temple where an image of Adi Shankara has been installed",
        "architecture": "Omkareshwara Temple is located at a distance of about 12 miles from Mortakka in Madhya Pradesh. A special feature of the location of Omkareshwar Temple is that the river Narmada branches into two and forms an island Mandhata or Shivapuri in the center. The shape of the island resembles that of the visual representation of the Omkara sound, Om. There are two temples here, one to Omkareshwar and one to Amareshwar.The Omkareshwar Temple is built in the Nagara style and is characterized by a lofty shikhara. There are also shrines to Annapurna and Ganesha here. Before entering the temple one has to pass through two rooms. The Omkareshwar is not affixed to the ground but is naturally installed there. There is always water around it. The significance of this linga is that the linga is not situated below the cupola. The idol of Lord Shiva is situated on the top of the temple. The temple can be reached by ferry from the banks of the river. A huge fair is organized here on the day of Kartik Poornima."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Omkareshwar2.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/8/88/Omkareshwar_Temple_02.jpg"
      },
      "trip": {
        "best_time": "The best time to visit Omkareshwar is from October to March. However, you can also visit during the monsoons as rains are mostly average here. The town is also very attractive during the festive season of Dusshera and if possible, you should visit this place during that time to see the illuminated town",
        "nearest_road": "  Arrive by taxi or bus at the temple from Indore, which is well connected with cities close by through a network of roads",
        "nearest_railway": " Arrive at the Omkareshwar Road Railway Station and the take a taxi or bus to reach the temple",
        "by_air": " Reach the Devi Ahilyabai Holkar Airport and arrive at the temple which is 83km from it by bus or taxi",
        "festivals": "Maha Shivratri:One of the most celebrated festival during the Phalgun month of the Hindu calendar. During this festival the whole island is beautifully illuminated. Pilgrims visit this place in large numbers and perform Shiv Puja after bathing in the river Narmada.Makar Sankranti:Makar Sankranti is a festival of harvest held in the month of January. During Makar Sankranti people fly kits in the island with lot of gusto.Kartik Poornima:Kartik Poornima is a festival celebrated on the full moon day in the November at the end of Chaturmas. It is a 10-day festival. On Somvati Amasvya, large number of devotees bathe in the river Narmada. A huge fair is organized during Kartik Poornima and people attend the fair in large numbers.Narmada Jayanti:This is a festival dedicated to Narmada. It is celebrated on the Magh month of the Hindu calendar. The birthday of Narmada is celebrated at 12 noon on this day. The entire island is illuminated with diyas and there is a firework displays"
      },
      "contact": {
        "address": "Tehasil Punasa, Omkareshwar, Madhya Pradesh, 451115",
        "phone": "917280271228"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/f/fe/Mamleshwar_Temple_01.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/5/5e/Omkareshwar1.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/e/ec/Mamleshwar_093840.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/c/c3/Omkareshwar2.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/5/5a/Mamleshwar_Jyotirlinga.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/8/88/Omkareshwar_Temple_02.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/88/Omkareshwar3.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/8b/Gomukh_ghat%2C_Omkareshwar_02.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/05/Narmada_in_Omkareshwar.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/c/c6/Shore_of_Narmada_at_Omkareshwar.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "4"
      ]
    },
    {
      "basic": {
        "name": "Kedarnath Jyotirlinga",
        "bio": "Kedarnath Temple ('temple of the God of the field') is a Hindu temple, one of the twelve jyotirlinga of Shiva. The temple is located on the Garhwal Himalayan range near the Mandakini river, in the state of Uttarakhand, India.",
        "location": {
          "pin": " \tKedarnath",
          "dist": " \t \tRudraprayag",
          "state": " \tUttarakhand",
          "iframe": "https://www.mappls.com/bdbf37"
        },
        "coordinates": {
          "x": 30.735194,
          "y": 79.066917
        },
        "website": "https://badrinath-kedarnath.gov.in/"
      },
      "Architecture": {
        "style": " \tNorth-Indian Himalayan Architecture",
        "creator": "Pandavas ",
        "completed": " No Data",
        "inscriptions": "None",
        "elevation": 3583
      },
      "about": {
        "basic_info": "     Kedarnath Temple ('temple of the God of the field') is a Hindu temple, one of the twelve jyotirlinga of Shiva. The temple is located on the Garhwal Himalayan range near the Mandakini river, in the state of Uttarakhand, India. Due to extreme weather conditions, the temple is open to the general public only between the months of April (Akshaya Tritiya) and November (Kartik Purnima, the autumn full moon). During the winters, the vigraha (deity) of the temple is carried down to Ukhimath to be worshipped for the next six months. Kedarnath is seen as a homogenous form of Shiva, the 'Lord of Kedarkhand', the historical name of the region.The temple is not directly accessible by road and has to be reached by a 22 kilometres (14 mi) uphill trek from Gaurikund. Pony, mule and manchan service is available to reach the temple. According to Hindu legends, the temple was initially built by the Pandavas, and is one of the twelve Jyotirlingas, the holiest Hindu shrines of Shiva. The Pandavas were supposed to have pleased Shiva by doing penance in Kedarnath. The temple is one of the four major sites in India's Chota Char Dham pilgrimage of Northern Himalayas and is the first of the Panch Kedar pilgrimage sites. This temple is the highest among the 12 Jyotirlingas. It is one of the 275 paadal petra sthalams expounded in the Tevaram, a sacred Tamil Shaivite text written during the 6th and 7th centuries by 63 saints called Nayanars. This temple is sung of by Thirugnanasambandar, Appar, Sundarar and Sekkizhar in their Tevaram texts.Kedarnath was the worst affected area during the 2013 flash floods in North India. The temple complex, surrounding areas, and Kedarnath town suffered extensive damage, but the temple structure did not suffer any major damage, apart from a few cracks on one side of the four walls which was caused by the flowing debris from the higher mountains. A large rock among the debris acted as a barrier, protecting the temple from the flood. The surrounding premises and other buildings in the market area were heavily damaged.",
        "history": "At a height of 3,583 m (11,755 ft), 223 km (139 mi) from Rishikesh, on the shores of Mandakini river, a tributary of Ganga, is a stone edifice of unknown date. It is not certain who built the original Kedarnath temple and when. The name 'Kedarnath' means 'the lord of the field': it derives from the Sanskrit words kedara (field) and natha (lord). The text Kashi Kedara Mahatmya states that it is so called because' the crop of liberation' grows here.Many folk legends related to the Garhwal region, Lord Shiva and the creation of the Panch Kedar temples are narrated.A folk legend about Panch Kedar relates to the Pandavas, the heroes of the Hindu epic Mahabharata. The Pandavas defeated and slew their cousins — the Kauravas in the epic Kurukshetra war. They wished to atone for the sins of committing fratricide (gotra hatya) and Brāhmanahatya (killing of Brahmins — the priest class) during the war. Thus, they handed over the reins of their kingdom to their kin and left in search of the lord Shiva and to seek his blessings. First, they went to the holy city of Varanasi (Kashi), believed to be Shiva's favourite city and known for its Kashi Vishwanath Temple. But, Shiva wanted to avoid them as he was deeply incensed by the death and dishonesty at the Kurukshetra war and was, therefore, insensitive to Pandavas' prayers. Therefore, he assumed the form of a bull (Nandi) and hid in the Garhwal region.Not finding Shiva in Varanasi, the Pandavas went to Garhwal Himalayas. Bhima, the second of the five Pandava brothers, then standing astride two mountains started to look for Shiva. He saw a bull grazing near Guptakashi (hidden Kashi — the name derived from the hiding act of Shiva). Bhima immediately recognized the bull to be Shiva. Bhima caught hold of the bull by its tail and hind legs. But the bull-formed Shiva disappeared into the ground to later reappear in parts, with the hump raising in Kedarnath, the arms appearing in Tungnath, the face showing up at Rudranath, the nabhi (navel) and stomach surfacing in Madhyamaheshwar and the hair appearing in Kalpeshwar. The Pandavas pleased with this reappearance in five different forms, built temples at the five places for venerating and worshipping Shiva.A variant of the tale credits Bhima for not only catching the bull but also stopping it from disappearing. Consequently, the bull was torn asunder into five parts and appeared at five locations in the Kedar Khand of Garhwal region of the Himalayas. After building the Panch Kedar Temples, the Pandavas meditated at Kedarnath for salvation, performed yagna (fire sacrifice) and then through the heavenly path called the Mahapanth (also called Swargarohini), attained heaven or salvation. The Panch Kedar Temples are constructed in the North-Indian Himalayan Temple architecture with the Kedarnath, Tungnath and Madhyamaheshwar temples looking similar. After completing the pilgrimage of Lord Shiva's darshan at the Panch Kedar Temples, it is an unwritten religious rite to visit Lord Vishnu at the Badrinath Temple, as a final affirmatory proof by the devotee that he has sought blessings of Lord Shiva.The Mahabharata, which gives the account of the Pandavas and the Kurukshetra War, does not mention any place called Kedarnath. One of the earliest references to Kedarnath occurs in the Skanda Purana (c. 7th-8th century), which contains a story describing the origin of the Ganges river. The text names Kedara (Kedarnath) as the place where Shiva released the holy water from his matted hair.According to the hagiographies based on Madhava's Sankshepa-shankara-vijaya, the 8th century philosopher Adi Shankara died at the mountains near Kedarnath; although other hagiographies, based on Anandagiri's Prachina-Shankara-Vijaya, state that he died at Kanchipuram. The ruins of a monument marking the purported death place of Shankara are located at Kedarnath. Kedarnath was definitely a prominent pilgrimage centre by the 12th century, when it is mentioned in Kritya-kalpataru written by the Gahadavala minister Bhatta Lakshmidhara.Kedarnath Teerth Purohits are the ancient Brahmins of this region, their ancestors (Rishi-Muni) have been worshiping the lingam since the time of Nara-Narayana and Daksh Prajapati. King Janmejay, grandson of the Pandavas, gave them the right of worshiping this temple and donate the whole Kedar region, and they have been worshiping pilgrims ever since.According to a tradition recorded by the English mountaineer Eric Shipton (1926), many hundreds of years ago one priest used to hold services at both the Kedarnath and Badrinath temples, travelling between the two places daily.The Kedarnath valley, along with other parts of the state of Uttarakhand, was hit with unprecedented flash floods on 16 and 17 June 2013. On 16 June, at about 7:30 p.m. a landslide and mudslides occurred near Kedarnath Temple with loud peals of thunder. An enormously loud peal was heard and huge amounts of water started gushing from Chorabari Tal or Gandhi Tal down Mandakini river at about 8:30 p.m. washing everything away in its path. On 17 June 2013 at about 6:40 a.m. waters again started cascading at a huge speed from river Swaraswati and Chorabari Tal or Gandhi Tal bringing along with its flow huge amount of silt, rocks, and boulders. A huge rock got stuck behind Kedarnath Temple and protected it from the ravages of the flood. The waters gushed on both the sides of the temple destroying everything in their path. Even eyewitness observed that one large rock got carried to the rear side of Kedarnath Temple, thus causing obstruction to the debris, diverting the flow of river and debris to the sides of the temple avoiding damage. The rock which protected the temple is worshipped as the God's Rock (भीम शीला).Another theory for the temple not being destroyed is because of its construction.Although the temple withstood the severity of the floods, the complex and surrounding area were destroyed, resulting in the death of hundreds of pilgrims and locals. Shops and hotels in Kedarnath were destroyed and all roads were broken. People took shelter inside the temple for several hours, until the Indian Army airlifted them to safer places. The Uttarakhand Chief Minister announced that the Kedarnath shrine would remain closed for a year for clearing the debris.The experts, who were asked by the Archaeological Survey of India to examine the condition of the foundation in wake of the floods have arrived at the conclusion that there was no danger to the temple. The IIT Madras experts visited the temple thrice for the purpose. Non-destructive testing instruments that do not disturb the structure of the temple were used by the IIT-team for assessing the health of the structure, foundation, and walls. They have submitted their interim report that the temple is stable and there was no major danger.Nehru Institute of Mountaineering (NIM) was given the responsibility of rebuilding Kedarnath. Although the institute did not have the expertise in urban planning or construction, they mastered in high altitude training. Under the leadership of veteran mountaineer, Colonel Ajay Kothiyal, NIM rigorously worked for a year and made the pilgrimage yatra possible from the next year.",
        "architecture": "The presiding image of Kedarnath in the form of lingam is of irregular shape with a pedestal 3.6 m (12 ft) in circumference and 3.6 m (12 ft) in height. There is a small pillared hall in front of the temple, that has images of Parvati and of the five Pandava princes. There are four temples around Kedarnath itself, namely- Tungnath, Rudranath, Madhyamaheshwar and Kalpeshwar which form the Panch Kedar pilgrimage sites. The first hall inside Kedarnath Temple contains statues of the five Pandava brothers, Krishna, Nandi, the vehicle of Shiva and Virabhadra, one of the guards of Shiva. Statues of Draupadi and other deities are also installed in the main hall. An unusual feature of the temple is the head of a man carved in the triangular stone lingam. Such a head is seen carved in another temple nearby constructed on the site where the marriage of Shiva and Parvati was held. Adi Shankara was believed to have revived this temple, along with Badrinath and other temples of Uttarakhand; he is believed to have attained Mahasamadhi at Kedarnath. Behind the temple is the samādhi mandir of Adi Sankara.Front view of the Kedarnath Temple in October 2022The head priest (Raval) of the Kedarnath temple belongs to the Veerashaiva community from Karnataka. However, unlike in Badrinath temple, the Raval of Kedarnath temple does not perform the pujas. The pujas are carried out by Raval's assistants on his instructions. The Raval moves with the deity to Ukhimath during the winter season. There are five main priests for the temple, and they become head priests for one year by rotation. The present (2013) Raval of Kedarnath temple is Shri Vageesha Lingacharya from Davanagere district, Karnataka. Surrounding Kedarnath, there are many symbols of the Pandavas. Raja Pandu died at Pandukeshwar. The tribals here perform a dance called 'Pandav Lila'. The mountain top where the Pandavas went to Swarga, is known as 'Swargarohini', which is located off Badrinath. When Yudhishtira, the eldest of the Pandavas, was leaving for the heaven, one of his fingers fell on the earth. At that place, Yudhishtira installed a Shiva Linga, which is the size of the thumb. To gain Mashisharupa, Lord Shiva and Bheema fought with maces. Bheema was struck with remorse. He started to massage Shiva's body with ghee. In memory of this event, even today, this triangular Shiva lingam is massaged with ghee. Water and bilva-patra leaves are used for worship."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/5/56/Kedarnath_Temple_in_Rainy_season.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/5/56/Kedarnath_Temple_in_Rainy_season.jpg"
      },
      "trip": {
        "best_time": "The best time to visit Kedarnath is either between May and June or between September and November. The Kedarnath Temple is open for visitors just for 6 months in the complete year. The opening date of this temple is announced on the auspicious occasion of Maha Shivratri.",
        "nearest_road": " When it comes to how to reach Kedarnath, you must know that Gaurikund is the last motorable road from Kedarnath. From there, it is a trek along the Himalayas.",
        "nearest_railway": " There is no railway station at Kedarnath. Rishikesh Railway Station is the nearest railway head from Kedarnath. Located about 210 km from Gaurikund, Rishikesh Railway Station is well connected to almost all the major cities of India and has a regular trains on a daily basis. From Rishikesh, one can take a bus to Gaurikund.",
        "by_air": " Kedarnath does not have an airport of its own which makes Jolly Grant Airport in Dehradun the nearest civil airhead. Located around 250 km from Kedarnath, Jolly Grant Airport is connected to the major cities of India including New Delhi, Mumbai, Kolkata and Chennai. There are plenty of flights operating to and fro from these cities and provide a lot of options in terms of flight timing and fares. Almost all the major airlines have flights to Jolly Grant Airport. Once you are in Dehradun, you can either take a bus or hire a cab to reach Kedarnath.",
        "festivals": "Badri-Kedar Festival-Held in the month of June, this festival lasts for eight days. One of the major festival celebrated in the Badrinath, Kedarnath temples. Many renowned artists from all parts of the country flock to the temple to take part in the cultural festival.Shravani Annakoot Mela-This festival is held in the harvesting season in the month of August. It is celebrated one day before the Raksha Bandhan day. On this day the ritual is to prepare food from the new harvested paddy and offer it to the Lord. And the Shivling is decked with a mixture of rice, wheat, other grains and pulses.Samadhi Puja-This puja is performed on the day the first day of Kartik when the Kedarnath Temple closes."
      },
      "contact": {
        "address": "Rudraprayag Gaurikund Road, Kedarnath, Uttarakhand, 246445",
        "phone": "+911389222083"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/5/56/Kedarnath_Temple_in_Rainy_season.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/88/Yamunotri_temple_and_ashram.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/b/b2/Gangotri_%28ganga_river%29.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/3/30/Kedarnath_Temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/f/f9/Badrinath_Temple_%2C_Uttarakhand.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/7/70/Panda_visit_Kedarnath.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/f/fc/Tungnath_temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/5/5f/Rudranath_temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/5/5f/Madhyamaheshwar_Temple%2C_Uttarakhand.JPG",
        "https://upload.wikimedia.org/wikipedia/commons/0/01/Kalpehswar.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/4/49/Kedarnath_Temple_in_Uttarakhand%2C_India%2C_by_Yogabrata_Chakraborty.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/3/3a/Way_to_kedarnathm.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/b/bd/Temple_in_the_aftermath_of_the_flood.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/6/64/Kedarnath_Temple_in_2014.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/b/b6/Kedarnath_Temple_-_OCT_2014.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/a/a2/Kedarnath_Temple_at_Dawn_-_OCT_2014.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "5"
      ]
    },
    {
      "basic": {
        "name": "Vaidyanath Jyotirlinga",
        "bio": "The Vaidyanath or Baidyanatha temple, also called Baba Baidyanath Dham is a Hindu Temple dedicated to Lord Shiva. It is located in Deoghar, in the Santhal Parganas division of the state of Jharkhand, India. It is one of the twelve Jyotirlingas, and considered to be the most revered places where Shiva lives.",
        "location": {
          "pin": "Baba Baidyanath Dham",
          "dist": "Deoghar",
          "state": "Jharkhand",
          "iframe": "https://www.mappls.com/ftcdca"
        },
        "coordinates": {
          "x": 24.4925,
          "y": 86.7
        },
        "website": "https://babadham.org/"
      },
      "Architecture": {
        "style": "Nagara style",
        "creator": "Raja Puran Mal ",
        "completed": "Reconstructed in 16th-19th",
        "inscriptions": "None",
        "elevation": 254
      },
      "about": {
        "basic_info": "     The Baidyanatha temple, also called Baba Baidyanath Dham is a Hindu Temple dedicated to Lord Shiva. It is located in Deoghar, in the Santhal Parganas division of the state of Jharkhand, India. It is one of the twelve Jyotirlingas, and considered to be the most revered places where Shiva lives.The temple complex comprises the central shrine of Baba Baidyanath, housing the revered Dham, along with additional 21 other temples.According to Hindu beliefs, it is said that the demon king Ravana worshipped Shiva at this location to gain divine blessings, which he used to cause chaos and destruction in the world. Ravana offered his ten heads as a symbol of sacrifice to Lord Shiva. Pleased with this gesture, Lord Shiva descended Ravana's injuries. As Lord Shiva acted as a doctor, he is also referred to as Vaidya ('doctor'). The temple is named after this aspect of Shiva.Kanwar Yatra (Devanagari: कांवड़ यात्रा) is an annual pilgrimage for the devotees of Shiva, known as Kānvarias (कांवड़िया) or 'Bhole' (भोले). They visit the Hindu pilgrimage sites of Ajgaibinath, and Sultanganj in Bihar to collect the sacred waters of the Ganges. Millions of people gather holy water from the Ganga and carry it as an offering for 105 km to the Baidyanath Temple in Deoghar, Jharkhand.                                                                           ",
        "history": "According to the legends, Ravana was performing penance in the Himalayan region to appease Lord Shiva. He offered nine of his heads as an offering to Lord Shiva. As he was to sacrifice his tenth head, Lord Shiva appeared before him and expressed satisfaction with the offering, Then, Shiva asked what boon he desired. Ravana asked to take the 'Atma Linga' to the island of Lanka and expressed his desire to take Lord Shiva from Kailash to Lanka.Lord Shiva agreed to Ravana's request but with a condition. He said that if the lingam was placed en route, it would become the permanent abode of the deity and could never be moved.Celestial gods became worried upon hearing that Lord Shiva had departed from his abode on Mount Kailash. They sought a resolution from Lord Vishnu. Then, Lord Vishnu asked Varuna, the deity associated with water, to enter Ravana's stomach through achamana, a ritual which involves sipping water from the palm of one's hand. As a consequence of performing achaman, Ravana departed for Lanka with the lingam and felt the need to urinate in the vicinity of Deoghar.The story goes that Lord Vishnu took the form of a cowherd named Baiju. While Ravana was off to urinate, he gave a lingam to this cowherd. Baiju positioned the lingam on the ground. Upon Ravana's return, he attempted to displace the lingam, but he was unsuccessful in his endeavor. He became upset and proceeded to press his thumb onto the lingam before departing. The Shiva lingam was then worshipped by Brahma, Vishnu, and other deities. Since then, Mahadev has taken up residence in Deoghar as the embodiment of the Atma Linga.Vaidyanatham Chitabhoomau  and Shivamaha puran Shatarudra Samhita  are the ancient verses that identify the location of Vaidyanth Jyotirlinga. According to which Shri Vaidyanatham is in 'Chitabhoomi', Dwadasha jyotirlinga stotram, Adi Sankaracharya has praised Shri Vaidyanath Jyotirlinga location in following verses, before Shivamaha puran Shatarudra Samhita as following:'Parlyam Vaidyanatham cha' instead of 'Vaidyanatham Chitabhumi' is an alternative reading for it.Adi Shankaracharya further evaluates the above main verse as :  पूर्वोत्तरे प्रज्वलिकानिधाने सदा वसन्तं गिरिजासमेतम्। सुरासुराराधितपादपद्मं श्रीवैद्यनाथं तमहं नमामि ॥भावार्थ:जो भगवान् शंकर पूर्वोत्तर दिशा में चिताभूमि वैद्यनाथ धाम के अन्दर सदा ही पार्वती सहित विराजमान हैं, और देवता व दानव जिनके चरणकमलों की आराधना करते हैं, उन्हीं ‘श्री वैद्यनाथ’ नाम से विख्यात शिव को मैं प्रणाम करता हूँ।This states that:I salute that Vaidyanatha, Whose lotus feet are worshipped By all asuras and devas And who lives in place of eternal shine,in the north east of (Vaidyanatham) of Chitabhoomi, along with his consort Parvathi. Also, Chitabhoomi indicates that, in olden days, this was a funeral place, where corpses were burnt, and post-death ceremonies were performed. This place could have been a center of tantric cults like Kapalika/Bhairava where Lord Shiva is worshipped significantly as shmashaan vaasin (meaning, one who resides in a crematorium), and a bhasma bhushita (meaning, smearing body with ashes of burnt bodies).The Dvadashalinga Smaranam also mentions its location as the verse is Prachikam Vaidyanatham, i.e., Vaidyanatham is in east (prachi means east). Another version of Dvadasalinga Smaranam mentions its location in the verse Paralyam Vaidyanatham, i.e.,Vaidyanatham is in Parali.The names and the locations of the 12 Jyotirlingas mentioned in the distorted version of Dvadasalinga Smaranam.Thus, the three temples claiming their shrines as 'real' jyotirlinga of Vaidyanath are Baidyanath temple at Deoghar, Jharkhand,Shri Vaijnath Temple at Parli, Maharashtra and Baijnath temple at Baijnath, Himachal Pradesh.Bhavishyapurana also describes Baidyanath as follows:Narikhande is district abounding in thickets. It lies west of the Dwarikashwari River. It extends along the Panchakuta hills on its west, and approaches Kikta on the north. The forests are very extensive, chiefly of Sakhota, Arjuna and Sal trees with a plentiful addition of brushwood. The district is celebrated for the shrine of Baidyanath. The deity is worshiped by people from all quarters and is the source of every good in the present age.It is believed that Shiva first manifested himself as a Jyotirlinga on the night of the Aridra Nakshatra, thus the special reverence for the Jyotirlinga. The same shrine of Vaidyanath is considered one of 51 Shakti Peethas, where 'heart' of Sati (goddess) fell, after being broken apart by the Sudarshana Chakra of Lord Vishnu, from the body of Dakshayani (Sati), carried by the lovelorn, distraught Shiva, at the location on which the respective temple is built. Since the heart of Sati fell here, the place is also called as Hardapeetha. Here Sati is worshipped as Jayaa Durga (Victorious Durga) and Lord Bhairava as Vaidyanath or Baidyanath. Dakshayani was reborn as Parvati, daughter of Himaavat, king of the mountains, and his wife, the Devi Mena.",
        "architecture": "The Maa Parvati temple is tied up with the main temple, with huge red sacred threads which is unique and worthy of reverence, showing the unity of Shiva and Shakti. According to the stories narrated in the Shiva Purana, the holy Baidyanath temple resembles the unity of souls and thus fits marriage for Hindus.The nearest railway station is Jasidih railway station, which is 7 km from Vaidyanath temple. Jasidh is 311 km from Howrah/Sealdah on Patna route. On a normal day, the worshipping of Baidyanath Jyotirlingam begins at 4 AM. The temple doors open at this time. At 4:00 am the 'patt' of Baidyanath Jyotirlingam opens and for the very sharp 15 minutes the 'Panda' (priest's families) offer Kacha Jal to LORD SHIVA, during 4:15am to 5:40 am, the Head priest worships with Shodashopachar. Locals also call it Sarkari Pooja. Then the devotees begin their worship of the Shivalinga. The most interesting tradition is that priests of the temple pour kuchcha Jal upon the lingam first, and later on, the pilgrims pour water and offer flowers and Bilva leaf, upon the lingam. The Puja rituals continue until 3.30 PM. After this, the temple doors are closed. In the evening at 6 PM the doors are opened again for devotees/ pilgrims and the process of worshipping begins again. At this time Shringar Puja takes place. The temple closes at 9:00 pm on a normal day, but during Holy Shravan month, the timings are extended. Unlike Somnath or Rameshwaram or Srisailam, here the devotees can get satisfaction by offering Abhishek themselves on Jyotirlinga. The devotee can also buy Peda as prasad from Babadham. Peda is a local sweet and is the speciality of Deoghar. Babadham has a regular and well-maintained office to accept offerings and donations.The Matsyapuran narrates the place as Arogya Baidyanathitee, the holy place where Shakti lives and assists Shiva in freeing people from incurable diseases. This whole area of Deoghar was under the rule of the Kings of Gidhaur who were much attached with this temple. Raja Bir Vikram Singh founded this princely state in 1266. In 1757 after the Battle of Plassey the officers of the East India Company paid their attention to this temple. An English man, Keating was sent to look at the administration of the temple. Mr. Keating, the first English collector of Birbhum, took interest in the administration of the temple. In 1788, under Mr. Keating's order Mr.Hesilrigg, his assistant, who was probably the first English man to visit the holy city, set out to supervise personally the collection of the pilgrim offerings and dues. Later, when Mr. Keating himself visited Babadham, he was convinced and forced to abandon his policy of direct interference. He handed over the full control of the temple to the hands of the high priest."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/b/b3/Baidyanathdham.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/0/04/Temples_at_Deorgag%2C_Santal_Parhanas%2C_Bihar_-_William_Hodges%2C_1782_-_BL_Foster_396.jpg"
      },
      "trip": {
        "best_time": "The best time for visiting the holy pilgrimage of Deoghar is in winters, especially during the months from October until March. The summers are unbearably hot while the monsoons might dampen your plans.",
        "nearest_road": " This area connects well by road to cities like Kolkata, Patna and Ranchi.",
        "nearest_railway": "The best way to reach Baidyanath Temple from Ranchi is by Train. The best railway station for this purpose is the Jasidih railway station which is at 8 kilometers. ",
        "by_air": " Lok Nayak Jayaprakash Airport, Patna, located around 272 km away is the nearest airport.",
        "festivals": "Millions of pilgrims visit this shrine every year. It is famous for the mela of Shraavana (a month of the Hindu calendar), between July and August. About 8 to 10 million devotees visit the place from various parts of India and offer holy water of Ganges (Uttarvahini Ganga) to the deity collected from Ajgaibinath , Sultanganj, which is almost 108 km from Deoghar and Baidyanath. The water is also brought by the Kānvarias, who carry the water in Kavadi, and walk all the distance, on barefoot. You will find large crowds walking all the way carrying water. An unbroken line of people in saffron-dyed clothes stretches over the full 108 km for the month. The pilgrims are called Dak Bam and they do not stop even once in their journey from Ajgaibinath Temple located at Sultanganj , Bhagalpur district to Vaidyanath. Pilgrims to the temple later visit the Basukinath temple"
      },
      "contact": {
        "address": "Shivganga Muhalla, Deoghar, Jharkhand 814112",
        "phone": "Not Available"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/0/04/Temples_at_Deorgag%2C_Santal_Parhanas%2C_Bihar_-_William_Hodges%2C_1782_-_BL_Foster_396.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/9/9f/Priests_conducting_worship_inside_the_Baijnath_temple.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "6"
      ]
    },
    {
      "basic": {
        "name": "Bhimashankar Jyotirlinga",
        "bio": "The Bhimashankar Mandir (also known Bhimashankar Jyotirlinga) is a Shiva mandir situated in its eponymous village, Bhimashankar, in Pune district of Maharashtra.It is a key pilgrimage centre and one of the 12 Jyotirlinga in the world",
        "location": {
          "pin": "Bhimashankar village,Khed",
          "dist": "Pune",
          "state": "Maharashtra",
          "iframe": "https://www.mappls.com/8c5f5a"
        },
        "coordinates": {
          "x": 19.072,
          "y": 73.536
        },
        "website": "https://www.bhimashankar.co.in/"
      },
      "Architecture": {
        "style": "Nagara style",
        "creator": "Reconstructed by Nana Phadanavis in 18th cent.",
        "completed": "13th CE(Original)",
        "inscriptions": "None",
        "elevation": 934
      },
      "about": {
        "basic_info": "   The Bhimashankar Mandir (also known as Bhimashankar or Bhimashankar Jyotirlinga) is a Shiva mandir situated in its eponymous village, Bhimashankar, in Pune district of Maharashtra. It is a key pilgrimage centre and one of the 12 Jyotirlinga in the world. The temple's Shiva lingam is one of the three Jyotirlinga of Maharashtra.The mandir is situated on a mountain. It is 110 kilometers away from Pune. The temple's vicinity has rare plant and animal species. The mandir is located in Khed taluka, in the Bhimashankar forest range.The Bhima River originates from the Bhimashankar village, and the hills of the Manmad village are present near it, there are old rock carvings of the God Bhimashankar, Bhootas and Amba-Ambika on these hills.",
        "history": "The shrine is linked to the legendary asura known as Tripura. The story goes that Tripura did penance, and Brahma, delighted with Tripura's penance, manifests and grants him three wishes. Tripura demanded that he be invulnerable to the gods, devils, yakshas, and gandharvas. His three 'puras' should be unbreakable, and he should be able to travel anywhere in the universe. All his desires were fulfilled. Tripura embarked on a conquest to subjugate three Loka. Indra, the deity associated with the heavens, was also vanquished. Indra made the decision to seek blessings from the deity Shiva and performed penance. Shiva made a vow to annihilate Tripura.On the peak of the Sahyadri hills, it is said that Shiva assumed the form of 'Bhīmā Shankara' at the behest of the Gods, and the sweat that spilled from his body after the battle is said to have formed the Bhimarathi riverAccording to Namdev, a saint in the medieval era, Saint Jnaneshwar went to Tryambakeshwar and then Bhimashankar. Namdev himself has also visited this place.Bhimashankaram shrine and the Bhimarathi river have been talked about in writings as far back as the 13th century; however, the current construction of the temple seems to be fairly new.The temple is built in the Nagrara style, which combines traditional and modern designs. The temple hall was constructed during the 18th century by Nāna Phadnavis of Peshwa.The Gopura-shikhara of the temple was built by Nāna Phadnavis. The village of Kharosi was granted to the temple by King Shivaji. The daily religious observance was funded through the financial resources which derived from the people of the area.He offered one here at Bhimashankar and the others in Menavali, near Wai, in front of a Shiva temple on the banks of the Krishna River, the Banshanker Temple in Pune, the Omkareshwar Temple in Pune, and the Ramlinga Temple in Pune (Shirur).Portuguese church's bell of Vasai donated by Chimaji Appa in 1739.Chimaji Appa (Brother of Bajirao I) donated a big bell to the temple, which is visible in front of the temple. This is one of the many Portuguese colonists' church's bell, which Chimaji - Maratha Empire army brought it from Vasai as souvenirs after defeating Portuguese at the Battle of Baçaim on 16-17 February 1739. This type of bell also present at the Khandoba temple and Naro Shankar mandir in Nashik",
        "architecture": "The architectural style of Bhimashankar is characterised by the use of the Nagara style, which is commonly found in northern India. The building style has some similarities to the Hemadpanthi style, which is common in the Deccan region. It is claimed that the old temple was built on a Swayambhu Shiva Linga.Furthermore, it can be seen that the Ling is located precisely in the center of the Garbhagriha (Sanctum sanctorum) of the temple. The garbhagriha and antarala are constructed using indigenous stone in the Indo-Aryan architectural style, which is also commonly found in Jain temples. The pillars and door frames of the temple are covered with intricate carvings of deities and human figures.In the 18th century, Nāna Phadnavis built the Sabhamandap; he also designed and built the shikhara. The Maratha King Chattrapati Shivaji Maharaj endowed this temple to facilitate religious ceremonies.In addition to the Bhimashankar Mandir, devotees also take darshan of the deities of temples present in the vicinity. There is a shrine for Siva Ganams, Shaakini and Daakini, who assisted Shiva in the battle against the demon Tripurasur.There are other temples near the main temple, such as Kamalaja mata, who is an incarnation of Goddess Parvathi and who aided Shiva in his battle against Tripurasur. Behind the Bhimashankar temple is Mokshakund Tirtha. The custom is to take a bath in the kund before proceeding to the temple. The kund is the result of Maha-muni Kaushika's legendary penance here. Additionally, there are the Jnyankund that Dattatreya created and the Sarvatirth connected to the goddess Bhashitadevi. Kusharanya tirth is located to the south of the temple, and it is from here that the Bhima River begins to flow eastward.A minor shrine dedicated to Lord Shani can be seen within the temple's grounds. There is a statue of Nandi in front of the Bhimashankar Shiva Linga.The 'Shani Temple' is situated within the main complex of the Bhimashankar temple.Between the two pillars in front of the 'Shani' shrine, there is an enormous antique Portuguese church bell. Behind the temple, there is a narrow walk that goes to the riverbanks. Outside the temple, there is a large area of forest that is sometimes broken up by forts on the mountains nearby."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Bhimashankar_temple_front.jpg/512px-Bhimashankar_temple_front.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Temple_front_view_2.jpg"
      },
      "trip": {
        "best_time": "The best season to visit Bhimashankar is the Monsoon season. The temperature remains comfortable and is apt for visiting the wildlife and other places of interest in Bhimashankar. The best months to visit are October, November, December, January, February and March.",
        "nearest_road": " Bhimashankar is located in the Bhorgiri village which is at a distance of only 50km from Khed, Rajguru Nagar. It is at a distance of 125km from Pune and takes around three and a half to four hours to reach. Road distance from Mumbai and Nasik is around 240km and 215 km respectively and Bhimashankar can be reached from this two places in well within 6 hours.",
        "nearest_railway": "Pune at a distance of 125km is the nearest railhead to Bhimashankar. Pune is not only well connected by rail to other Maharashtra cities but also with most of the major cities in India. ",
        "by_air": " Pune, at a distance of 125km is the nearest domestic airport to Bhimashankar while Mumbai is the nearest international airport at a distance of 240km.",
        "festivals": "Kartik Poornima: It falls on a full moon day on the fifth lunar day of Kartik, in the month of November/ December. This day is celebrated with lot of enthusiasm.Mahashivratri: This day comes in the month of February, and according to Hindu calendar in the month of Magh on the day of Krishna Paksh Chaturdashi.Ganesh ChaturthiThis festival is celebrated in the month of August/September with great splendour and grandeur.Diwali: The festival of Lights is celebrated in the month of October/ November at Bhimashankar with great pomp and show."
      },
      "contact": {
        "address": " Village Bhavagiri,Bhimashankar, Khed, Pune District, Maharashtra, 410509",
        "phone": "+919421034485, +917038555248, +919970045972"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/0/09/Bhimashankar_temple_front.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/9/9f/Temple_front_view_2.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/d9/Temple_entry_gate.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/6/6c/Bhimashankar_Naagphani_kada4.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/e/e5/Bhimashankar_Naagphani_kada3.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/8/84/Temple_front_view3.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/b/b0/Bhimashankar_Naagphani_kada2.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/da/Bhimashankar_Naagphani_kada1.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/2/29/Temple_top_view1.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/d7/Edited_temple_kalash.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/09/Bhimashankar_temple_front.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "7"
      ]
    },
    {
      "basic": {
        "name": "Kashi Vishwanath  Jyotirlinga",
        "bio": "The Kashi Vishwanath Temple is a famous Hindu temple dedicated to Shiva. It is located in Vishwanath Gali, near Varanasi, Uttar Pradesh, India.",
        "location": {
          "pin": "Vishwanath Gali",
          "dist": "Varanasi",
          "state": "Uttar Pradesh",
          "iframe": "https://www.mappls.com/6f6t46"
        },
        "coordinates": {
          "x": 25.310775,
          "y": 83.010614
        },
        "website": "https://www.shrikashivishwanath.org/"
      },
      "Architecture": {
        "style": "Nagara style",
        "creator": "Unknown",
        "completed": "1585 CE - by Man Singh I,1780 CE - by Ahilyabai Holkar",
        "inscriptions": "None",
        "elevation": 1320
      },
      "about": {
        "basic_info": "   The Kashi Vishwanath Temple is a famous Hindu temple dedicated to Shiva. It is located in Vishwanath Gali, near Varanasi, Uttar Pradesh, India. The temple is one of the most sacred Hindu pilgrimage sites and is among the twelve Jyotirlinga, shrines which are said to be the most sacred abodes of Shiva. Standing on the western banks of the Ganges, the presiding deity is known by the names Shri Vishwanath and Vishweshwara (IAST: Vishveshvara or Vishveshvur), literally meaning Lord of the Universe.Varanasi was called Kashi ('shining') in ancient times, and hence the temple is popularly called Kashi Vishwanath Temple. The temple is considered a central part of worship in Shaiva culture by Hindu scriptures.The temple had been demolished several times, most recently by Mughal emperor Aurangzeb, who constructed the Gyanvapi Mosque on its site. The current structure was built on an adjacent site by the Maratha ruler Ahilyabai Holkar of Indore in 1780.Since 1983, the temple has been managed by a board of trustees set up by the government of Uttar Pradesh.",
        "history": "As per the Shiva Purana, Brahma (the Hindu God of creation) and Vishnu (the Hindu God of preservation) once had an argument about supremacy. To test their powers, Shiva pierced the three mystical states of the earth as a huge, endless pillar of light, known as a Jyotirlinga. At first, Vishnu incarnated as a boar (Varaha) to dig the earth to search for the base of the pillar, while Brahma, in the form of a swan, searched the sky to find the top of the pillar. Brahma falsely claimed to have found the top of the pillar. However, Vishnu confessed modestly about his failure to locate the base. Shiva cut off Brahma's fifth head as a punishment and cursed Brahma, saying that he would no longer be worshipped. Because Vishnu was honest, he would be worshipped just as much as Shiva and have his own temples for all time.The Manikarnika Ghat is on the bank of the river Ganges. This holy site is very near the Kashi Vishwanath Temple and is named Shakti Pitha, a revered place of worship for the Shaktism sect. The Daksha Yaga, an important Shaivite literature, also mentions the origin of Shakti Peethas.Hindu scriptures describes Vishweshara as the sacred deity of Varanasi, holding the position of king over all the other deities as well as over all the inhabitants of the city and the extended circuit of the Panchkosi, an area (the sacred boundary of Varanasi) spreading over 50 miles.The temple is mentioned in the Puranas including the Kashi Khanda (section) of Skanda Purana (4th-5th century).The original Vishwanath temple, initially known as the Adi Vishveshwara Temple, was destroyed by the Ghurids in 1194, when Mu'izz al-Din Muhammad ibn Sam returned to India and defeated Jayachandra of Kannauj near Chandawar and afterwards razed the city of Kashi. In a few years, the Razia Mosque was constructed in its place. In 1230, the temple was rebuilt near the Avimukteshwara Temple, away from the main site, during the reign of Delhi's Sultan Iltutmish (1211–1266). It was demolished again during the rule of either Hussain Shah Sharqi (1447–1458) or Sikandar Lodi (1489–1517).Raja Man Singh built the temple during Mughal Emperor Akbar's rule. Raja Todar Mal further rebuilt the temple in 1585, but orthodox Brahmins chose to boycott the temple because his daughter was married to Islamic rulers. During the rule of Jahangir, Vir Singh Deo either restored or completed the construction of an earlier temple. In 1669, Mughal Emperor Aurangzeb destroyed the temple and built the Gyanvapi Mosque in its place. The remains of the erstwhile temple can be seen in the foundation, the columns, and at the rear part of the mosque.In 1742, the Maratha ruler Malhar Rao Holkar made a plan to demolish the mosque and reconstruct the Vishweshwar temple at the site. However, his plan did not materialise, partially because of the intervention of the Nawab of Awadh, who was given control of the territory. Around 1750, the Maharaja of Jaipur commissioned a survey of the land around the site, with the objective of purchasing land to rebuild the Kashi Vishwanath temple. However, his plan to rebuild the temple did not materialise either. In 1780, Malhar Rao's daughter-in-law Ahilyabai Holkar rebuilt the present temple adjacent to the mosque.In 1828, Baiza Bai, widow of the Maratha ruler Daulat Rao Scindhia of Gwalior State, built a low-roofed colonnade with over 40 pillars in the Gyan Vapi precinct. During 1833–1840, the boundary of Gyanvapi Well, the ghats and other nearby temples were constructed. Many noble families from various ancestral kingdoms of the Indian subcontinent and their prior establishments make generous contributions for the operations of the temple.In 1835, Maharaja Ranjit Singh of the Sikh Empire, on the behest of his wife, Maharani Datar Kaur, donated 1 tonne of gold for plating the temple's dome. In 1841, Raghuji Bhonsle III of Nagpur donated silver to the temple.The temple was managed by a hereditary group of pandits or mahants. After the death of Mahant Devi Dutt, a dispute arose among his successors. In 1900, his brother-in-law Pandit Visheshwar Dayal Tewari, filed a lawsuit, which resulted in him being declared the head priest.The puja of the Maa Shringar Gauri Temple, on the western side of the disputed Gyanvapi Mosque, was restricted after the demolition of the Babri Masjid in December 1992 due to the ensuing deadly riots that followed the demolition of the mosque. In August 2021, five Hindu women petitioned a local court in Varanasi to be allowed to pray at the Maa Shringar Gauri Temple.Prime Minister Narendra Modi addressing at the inauguration of Kashi Vishwanath Dham on 13 December 2021.In 2019, the Kashi Vishwanath Corridor Project was launched by Narendra Modi to ease access between the temple and the Ganges River, creating a wider space to prevent overcrowding. On 13 December 2021, Modi inaugurated the corridor with a sacred ceremony. A press release by the government said that around 1,400 residents and businesses within the corridor's area were relocated elsewhere and compensated. It also said that more than 40 ruined, centuries-old temples were found and rebuilt, including the Gangeshwar Mahadev temple, the Manokameshwar Mahadev temple, the Jauvinayak temple, and the Shri Kumbha Mahadev temple.In February 2022, the sanctum sanctorum of the temple was gold-plated after an anonymous donor from South India donated 60 kg of gold to the temple. Flowers from the temple are recycled into incense by the biomaterials startup Phool.co.",
        "architecture": "The temple complex consists of a series of smaller shrines, located in a small lane called the Vishwanatha Galli, near the river. The linga of the main deity at the shrine is 60 centimetres (24 in) tall and 90 centimetres (35 in) in circumference housed in a silver altar. The main temple is quadrangle and is surrounded by shrines of other gods. There are small temples for Kala Bhairava, Kartikeya, Avimukteshwara, Vishnu, Ganesha, Shani, Shiva and Parvati in the complex.There is a small well in the temple called the Jnana Vapi also spelled as Gyan vapi (the wisdom well). The Jnana Vapi well sites to the north of the main temple and during the invasion by the Mughals the Jyotirlinga was hidden in the well to protect it at the time of invasion. It is said that the main priest of the temple jumped in the well with the lingam in order to protect the Jyotirlinga from invaders.There is a Sabha Griha or Congregation Hall leading to the inner Garbha Griha or Sanctum Sanctorum. The venerable Jyotirlinga is a dark brown coloured stone which is enshrined in the Sanctum, placed on a silver platform. Structure of the Mandir is composed of three parts. The first compromises a spire on the temple. The second is gold dome and the third is the gold spire atop the sanctum bearing a flag and a trident.The Kashi Vishwanath temple receives around 3,000 visitors every day. On certain occasions, the numbers reach 1,000,000 and more. Noteworthy about the temple is 15.5-metre-high gold spire and gold Onion dome. There are three domes each made up of pure gold, donated by Maharaja Ranjit Singh in 1835.Ganga Dwara, Gateway of Corridor that connects Kashi Vishwanath Temple with Ghats of Ganges.The Shri Kashi Vishwanath Dham corridor was constructed between Kashi Vishwanath Temple and Manikarnika Ghat along the Ganges River, providing various amenities for pilgrims.Located on the banks of the holy Ganges, Varanasi is regarded among the holiest of the Hindu cities. The Kashi Vishwanath temple is widely recognised as one of the most important places of worship in the Hindu religion. Inside the Kashi Vishwanath Temple is the Jyotirlinga of Shiva, Vishveshvara or Vishvanath. The Vishveshvara Jyotirlinga has a very special and unique significance in the spiritual history of India.Many leading saints, including Adi Sankaracharya, Ramakrishna Paramhansa, Swami Vivekananda, Bamakhyapa, Goswami Tulsidas, Swami Dayananda Saraswati, Sathya Sai Baba, Yogiji Maharaj, Pramukh Swami Maharaj, Mahant Swami Maharaj and Gurunanak have visited the site. A visit to the temple and a bath in the river Ganges is one of many methods believed to lead one on a path to Moksha (liberation). Thus, Hindus from all over the world try to visit the place at least once in their lifetime. There is also a tradition that one should give up at least one desire after a pilgrimage the temple, and the pilgrimage would also include a visit to the temple at Rameswaram in Tamil Nadu in Southern India, where people take water samples of the Ganges to perform prayer at the temple and bring back sand from near that temple. Because of the immense popularity and holiness of Kashi Vishwanath temple, hundreds of temples across India have been built in the same architectural style. Many legends record that the true devotee achieves freedom from death and saṃsāra by the worship of Shiva, Shiva's devotees on death being directly taken to his abode on Mount Kailash by his messengers and not to Yama. The superiority of Shiva and his victory over his own nature—Shiva is himself identified with death—is also stated. There is a popular belief that Shiva himself blows the mantra of salvation into the ears of people who die naturally at the Vishwanath temple."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Benares-_The_Golden_Temple%2C_India%2C_ca._1915_%28IMP-CSCNWW33-OS14-66%29.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Benares-_The_Golden_Temple%2C_India%2C_ca._1915_%28IMP-CSCNWW33-OS14-66%29.jpg"
      },
      "trip": {
        "best_time": "The best time to visit Varanasi for a temple darshan is in the winter months, between October through March. The weather, though cold in December and January, suits travellers since most sightseeing is outdoors. If you are not looking to attend one of the aartis, then the best time to visit the temple is at 7 AM, to avoid long queues",
        "nearest_road": " Varanasi has a wide and expansive road network, with frequent private and public buses and other road transport services to all major cities and towns in Uttar Pradesh.",
        "nearest_railway": "Varanasi city is well connected by railway, and the temple itself is close to a number of railway stations. Varanasi City station is just 2 km away, and Varanasi Junction is around 6 km from the temple.  ",
        "by_air": " The closest airport to the temple is the Lal Bahadur Shastri International Airport in Babatpur. From there, the temple is around 25 km or less than an hour by road. There are cabs and buses, private and public, that can take you to the temple straight from the airport.",
        "festivals": "Makar Sankranti – According to the solar calendar the sun moves from the Dhanu rashi to the Makar rashi on this day. The period of Uttarayan starts from this day when the sun begins its journey to the northern hemisphere.Basant Panchami – Celebrates the arrival of spring and also Saraswati the goddess of knowledge is worshipped on this day. Maha Shivaratri – This is the great night of Shiva and the most important festival in Varanasi. Here they celebrate this as the night when Shiva married Parvati. A huge wedding procession called Shiva Baraat is taken out in the lanes to the beating of drums and shouts of “Jai Bhole Shankar!” People fast and pray for the day and night. It is also said that on this night Shiva takes the form of Nataraja, the Lord of Dance and dances the tandava.Rangbhari Ekadashi – Lord Vishwanath at the Kashi Vishwanath temple is given a special shringar or decoration.Holi – The festival of colours. This is a bacchanalia with people drinking intoxicants and throwing colours. Visitors are recommended to stay indoors."
      },
      "contact": {
        "address": "  Vishwanath Gali, Lahori Tola, Varanasi, Uttar Pradesh, 221001",
        "phone": "+916393131608,+915422392629"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/e/eb/Benares-_The_Golden_Temple%2C_India%2C_ca._1915_%28IMP-CSCNWW33-OS14-66%29.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "8"
      ]
    },
    {
      "basic": {
        "name": "Trimbakeshwar Jyotirlinga",
        "bio": "The Shri Trimbakeshwar Shiva Temple  is an ancient Hindu temple in the town of Trimbak, in the Trimbakeshwar tehsil in the Nashik District of Maharashtra, India, 28 km from the city of Nashik and 40 km from Nashik road.",
        "location": {
          "pin": "\tTrimbak",
          "dist": "\tNashik",
          "state": "\tMaharashtra",
          "iframe": "https://www.mappls.com/26a2e1"
        },
        "coordinates": {
          "x": 19.932222,
          "y": 73.530833
        },
        "website": "https://www.trimbakeshwartrust.com/"
      },
      "Architecture": {
        "style": "\tHemadpanthi",
        "creator": "\tBalaji Baji Rao",
        "completed": "1740-1760 AD",
        "inscriptions": "None",
        "elevation": 915
      },
      "about": {
        "basic_info": "The Shri Trimbakeshwar Shiva Temple (श्री त्र्यंबकेश्वर ज्योतिर्लिंग मंदिर) is an ancient Hindu temple in the town of Trimbak, in the Trimbakeshwar tehsil in the Nashik District of Maharashtra, India, 28 km from the city of Nashik and 40 km from Nashik road. It is dedicated to Hindu god Shiva and is one of the twelve jyotirlingas where the Hindu genealogy registers at Trimbakeshwar, Maharashtra are kept. The origin of the sacred Godavari river is near Trimbak.Kusavarta kunda (sacred pond) in the temple premises, built by Shrimant Sardar Raosaheb Parnerkar who was the Fadnavis of Indore State, is the source of the Godavari River, the second longest river in peninsular India. A bust of Sardar Fadnavis and his wife can be seen on the edge of the kunda. The current temple was built by Peshwa Balaji Baji Rao after it was destroyed by Mughal ruler Aurangzeb.",
        "history": "Brahma worshipped God Trivikram when he came to Satya Loka (on earth) with the same holy water of the Ganges, to get the river Ganges held up by Shiva on his head, to flow. There was a famine of 24 years and people were affected by the pangs of hunger. However, Varuna - the God of Rains, pleased with Sage Gautama arranged rains every day in Maharishi Gautama's Ashram (dwelling place) which was in Trimbakeshwar. Maharishi Gautama used to sow rice in the surrounding fields of his Ashram in the morning, reap the crop in the afternoon and with it fed a large group of Hrishis, who took shelter in his Ashram on account of the famine. The blessings of the group of rishis increased the merit (Punya) of Sage Gautama. Indra's position became shaky because of his increased merit. So Indra ordered clouds to rain all over Trimbakeshwar, so that the famine will be over and rishis will go back and the increasing merits of Maharishi Gautama will be weakened. Although the famine was over, Maharishi Gautama urged the Rishis to stay back and kept on feeding them and gaining merit. Once he saw a cow grazing in the paddy field and he drove her away by throwing Darbha (sharp, pointed grass). The slender cow died by this. It was Devi Jaya - Mata Parvati's friend, who had taken the form of a cow. This news upset the Rishis and they refused to luncheon at his Ashram. Maharishi Gautama requested Rishis to show a way out of this sin. He was advised to approach Shiva and request him to release the Ganges and a bath in the Ganges would set him free of his sins. Maharishi Gautama then practiced penance by going to the peak of Brahmagiri for 1000 years. Shiva was pleased by his worships and gave him the Ganges.Kusavarta, a place where river Godavari takes course.However, Ganges was not prepared to part with Shiva, which irritated him. He made TandavNrutya (dance) on the peak of Brahmagiri and dashed his jata there. Frightened by this action, Ganges appeared on Brahmagiri. Later on, Ganges appeared in the Trimbak Tirtha. Maharishi Gautama praised her but she appeared on the mountain at various places and disappeared in anger. Maharishi Gautama could not bathe in her waters. The Ganges then appeared in Gangadwar, Varaha-tirtha, Rama-Laxman tirtha, Ganga Sagar tirtha. Still, Maharishi Gautama could not bathe in her waters. Then, Maharishi Gautama surrounded the river with enchanted grass and put a vow to her. The flow stopped there and the tirtha thus came to be called Kushavarta. It is from this Kushavarta that the river Godavari flows up to the sea. The sin of killing a cow by Maharishi Gautama was wiped off here.This place is famous for its many religious rituals (vidhis). Narayan Nagbali, Kalsarpa Shanti, Tripindi Vidhi are done here. Narayan Nagbali puja is performed at Trimbakeshwar only. This puja is performed in three days. This puja is performed on special dates. Some days are not suitable to perform this puja. This puja is performed for many reasons like to cure an illness, going through bad times, killing a Cobra (Nag), childless couples, financial crisis or you want to perform some religious puja to have everything.Trimbakeshwar town has a large number of Brahmin households and is also a centre for Vedic Gurukuls (kind of boarding school). It also has ashrams and Muths devoted to Ashtanga Yoga, the Hindu art of living.The existing temple was built out of basalt after it was commissioned by Peshwa Nanasaheb. It so happens that the Peshwa made a bet on whether the stone surrounding the Jyotirlinga, is hollow from the inside or not. The stone was proved to be hollow, and on losing the bet, the Peshwa built a marvelous temple out of it.The Shiva deity of the temple consisted of the world-famous Nassak Diamond. It was looted by the British in The Third Anglo-Maratha War and lies with one owner or the other ever since. The diamond presently lies with Edward J. Hand, a trucking firm executive from Greenwich, Connecticut, USA.The place is known for its scenic beauty in rainy/monsoon season and is surrounded by lush green hills untouched by pollution. Anjaneri mountain, the birthplace of Hanuman, is 7 km from Trimbakeshwar.Shri Trimbakeshwar is a religious center having one of the twelve Jyotirlingas. The extraordinary feature of the Jyotirlinga located here is its three faces embodying Brahma, Vishnu, and Shiva. Due to the excessive use of water, the linga has started to erode. It is said that this erosion symbolizes the eroding nature of human society. The Lingas are covered by a jeweled crown which is placed over the Gold Mask of Trideva (Brahma Vishnu Shiva). The crown is said to be from the age of Pandavas and consists of diamonds, emeralds, and many precious stones. The crown is displayed every Monday from 4-5 pm (Shiva).All other Jyotirlingas have Shiva as the main deity. The entire black stone temple is known for its appealing architecture and sculpture and is at the foothills of a mountain called Brahmagiri. Three sources of the Godavari originate from the Brahmagiri mountain.",
        "architecture": "The temple is located between three hills namely Brahmagiri, Nilagiri and Kalagiri. The temple has three lingas (an iconic form of Shiva) representing Shiva, Vishnu and Brahma. The temple tank is called Amritavarshini, which measured 28 m (92 ft) by 30 m (98 ft). There are three other bodies of water, namely, Bilvatirtha, Viswanantirtha and Mukundatirtha. There are images of various deities, namely, Ganga, Jaleswara, Rameswara, Gautameswara, Kedarnatha, Rama, Krishna, Parashurama and Lakshmi Narayana. The temple has also several monasteries and samadhis of saints.The Trimbakeshwar temple is considered to be the 8th Jyotirlinga. The entire temple is built with only black stones that elevate its architecture. The temple was built in the 18th century and in the Nagara-styled that houses a spacious courtyard too. The temple is on an elevated platform, also known as the Shikhara, with a stone plate carved that is shaped into a lotus. The Garbagriha is the innermost part of the temple, and the raised walls of the temple guard the temple deity. The Garbagriha has a hall that has a mandap in front of it, with three entrances.The walls and the pillars of the temple are adorned with designs of Hindu figures, deities, flowers, humans, and animals. The alluring architecture of the Trimbakeshwar Temple is intricate and displays a rich sense of the culture of that century. This temple also has a mirror that is placed at a height, which helps devotees to take a peek at the deity’s reflection."
      },
      "photos": {
        "cover": "https://upload.wikimedia.org/wikipedia/commons/1/12/Trimbakeshwar_Temple-Nashik-Maharashtra-1.jpg",
        "profile": "https://upload.wikimedia.org/wikipedia/commons/0/08/Trimbakweshwar_Temple_Entrance.jpg"
      },
      "trip": {
        "best_time": "Early morning is the best time to visit the temple. Month wise the best time to visit Trimbakeshwar Jyotirlinga Nashik is October to March as the weather is pleasant and it is bearable to stand in the sun. but keep in mind that this is a high tourist season. If you want to beat the crowds, visit in monsoon.",
        "nearest_road": " Shri Trimbakeshwar Shiva Temple is 30 kilometers on road from Nashik.",
        "nearest_railway": "The closest railway station is the Nashik Road Railway Station that is 39 kilometers by road.",
        "by_air": " Nashik Airport is located at Ozar, 20 kilometers (12 mi) northeast of Nashik, Maharashtra.",
        "festivals": "Maha Shivaratri: Maha Shivaratri, meaning the “Great Night of Shiva,” is one of the most important festivals celebrated at Trimbakeshwar Temple. It usually occurs in February or March, depending on the Hindu lunar calendar. The temple premises are adorned with decorations, and various rituals and cultural performances are held throughout the night, creating a vibrant and spiritual atmosphere.Shravan Somvar: Shravan Somvar is observed during the holy month of Shravan (July or August) and is dedicated to Lord Shiva. Devotees undertake fasting and visit Trimbakeshwar Temple every Monday of the month, offering prayers and performing special rituals.Kumbh Mela: Trimbakeshwar is one of the four cities that host the grand Kumbh Mela, a Hindu pilgrimage of immense significance. The Kumbh Mela occurs every 12 years, rotating between four locations, including Trimbakeshwar. The Kumbh Mela at Trimbakeshwar is an extraordinary experience, showcasing a convergence of faith, culture, and devotion.Navratri: Navratri is a nine-night festival dedicated to the worship of Goddess Durga. It usually falls in September or October. Trimbakeshwar Temple witnesses special ceremonies and performances during Navratri. The temple premises are adorned with colorful decorations, and cultural programs like Garba, and Dandiya Raas are organized, creating a lively and spirited ambiance."
      },
      "contact": {
        "address": " Trimbak, Nashik,  Maharashtra 422212",
        "phone": "+912594234335, +912594233215, +912594234251"
      },
      "gallery": [
        "https://upload.wikimedia.org/wikipedia/commons/1/12/Trimbakeshwar_Temple-Nashik-Maharashtra-1.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/08/Trimbakweshwar_Temple_Entrance.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/f/f6/Trimbhakeshwar_Temple.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/6/65/Tryambakeshwar_Kund.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/d/dc/Mahadeva_Temple_Nashik.jpg"
      ],
      "tag": [
        "jyotirlinga",
        "9"
      ]
    }
  ]